[
    [
        [
            "Why shouldn''t you tell a secret on a farm? Because the potatoes have eyes, the corn has ears, and the beans stalk.",
            "Q: Why shouldn''t you tell a secret on a farm?\n A: Because the potatoes have eyes and the corn has ears."
        ],
        0.2222222222222222,
        [
            267,
            1644
        ]
    ],
    [
        [
            "It’s a 5 minute walk from my house to the pub. It’s a 35 minute walk from the pub to my house.  The difference is staggering.",
            "It’s a five minute walk from my house to the pub. It’s a thirty five minute walk from the pub to my house.\n The difference is staggering."
        ],
        0.17391304347826086,
        [
            310,
            4212
        ]
    ],
    [
        [
            "What do you call a lazy kangaroo? A pouch potato.",
            "Q: What do you call a lazy kangaroo?\n A: A pouch potato"
        ],
        0.21428571428571427,
        [
            399,
            1579
        ]
    ],
    [
        [
            "What do you call a bear with no teeth? A Gummy-Bear.",
            "Q: What do you call a bear with no teeth?\n A: Gummybear"
        ],
        0.3125,
        [
            424,
            1584
        ]
    ],
    [
        [
            "A distinguished young woman on a flight from Switzerland asked the priest beside her, \"Father, may I ask a favour?\" \"Of course. What may I do for you?\" \"Well, I bought an expensive electronic hair dryer that is well over the customs limits and I''m afraid they''ll confiscate it. Is there anyway you could carry it through Customs for me? Under your robes perhaps?\" \"I would love to help you, dear, but I must warn you: I will not lie.\" \"With your honest face, Father, no one will question you.\" When they got to Customs, she let the priest go ahead of her. The official asked, \"Father, do you have anything to declare?\" \"From the top of my head down to my waist, I have nothing to declare.\" The official thought this answer strange, so asked, \"And what do you have to declare from your waist to the floor?\" \"I have a marvelous little instrument designed to be used on a woman, but which is, to date, unused.\" Roaring with laughter, the official said, \"Go ahead, Father. Next!\"",
            "“Father, do you have anything to declare?” A beautiful young woman, on an international flight, asked the priest beside her, “Father, may I ask a favor?”\n “Of course you may. What can I do for you?”\n “Well, I bought this expensive electronic hair dryer that is well over the Customs limits and I’m afraid  that they’ll confiscate it from me. Is there anyway that you could carry it through Customs for me? Under your robes perhaps?”\n “I would love to help you, dear, but I must warn you: I will not lie.”\n “With your honest face, Father, no one will question you.”\n When they got to Customs, the young lady let the priest go ahead of her. The Customs Officer asked, “Father, do you have anything to declare?”\n “From the top of my head down to my waist, I have nothing to declare.”\n The Officer thought this answer strange, so he asked, “And what do you have to declare from your waist to the floor?”\n “I have a marvelous little instrument designed to be used on a woman, but which is, to date, unused.”\n Roaring with laughter, the Officer said, “God bless you, Father, go ahead.”"
        ],
        0.2097902097902098,
        [
            492,
            3987
        ]
    ],
    [
        [
            "A distinguished young woman on a flight from Switzerland asked the priest beside her, \"Father, may I ask a favour?\" \"Of course. What may I do for you?\" \"Well, I bought an expensive electronic hair dryer that is well over the customs limits and I''m afraid they''ll confiscate it. Is there anyway you could carry it through Customs for me? Under your robes perhaps?\" \"I would love to help you, dear, but I must warn you: I will not lie.\" \"With your honest face, Father, no one will question you.\" When they got to Customs, she let the priest go ahead of her. The official asked, \"Father, do you have anything to declare?\" \"From the top of my head down to my waist, I have nothing to declare.\" The official thought this answer strange, so asked, \"And what do you have to declare from your waist to the floor?\" \"I have a marvelous little instrument designed to be used on a woman, but which is, to date, unused.\" Roaring with laughter, the official said, \"Go ahead, Father. Next!\"",
            "A distinguished young woman on a flight from Ireland asked the Priest beside her, ''Father, may I ask a favour?'' ''Of course child. What may I do for you?'' \n ‘Well, I bought an expensive woman''s electronic hair dryer for my Mother''s birthday that is unopened and well over the Customs limits, and I''m afraid they''ll confiscate it. Is there any way you could carry it through customs for me? Under your robes perhaps?''\n ''I would love to help you, dear, but I must warn you: I will not lie.''\n ''With your honest face, Father, no one will question you.''\n When they got to Customs, she let the priest go ahead of her. The official asked, ''Father, do you have anything to declare?''\n ''From the top of my head down to my waist, I have nothing to declare.''\n The official thought this answer strange, so asked, ''And what do you have to declare from your waist to the floor?''\n ''I have a marvelous instrument designed to be used on a woman, but which is, to date, unused.''"
        ],
        0.18571428571428572,
        [
            492,
            4025
        ]
    ],
    [
        [
            "Old mathematicians never die... They just lose some of their functions.",
            "Old mathematicians never die; they just lose some of their functions."
        ],
        0.26666666666666666,
        [
            517,
            1767
        ]
    ],
    [
        [
            "How was Rome split in two? With a pair of Ceasars.",
            "How was Rome split in two? With a pair of Ceasars"
        ],
        0.07692307692307693,
        [
            556,
            797
        ]
    ],
    [
        [
            "I went into a pet shop and asked for twelve bees. The shopkeeper counted out thirteen and handed them over. “You’ve given me one too many.” “That one is a freebie.”",
            "I went into a pet shop and asked for twelve bees. The shopkeeper counted out thirteen and handed them over. “You’ve given me one too many.”  \n “That one is a freebie.”"
        ],
        0.0,
        [
            559,
            4322
        ]
    ],
    [
        [
            "The past, the present, and the future walk into a bar. It was tense!",
            "The past, the present, and the future walk into a bar…\n It was tense."
        ],
        0.23529411764705882,
        [
            561,
            1600
        ]
    ],
    [
        [
            "My ex-wife still misses me. But her aim is starting to improve!",
            "My ex-wife still misses me. But her aim is starting to improve"
        ],
        0.07692307692307693,
        [
            564,
            765
        ]
    ],
    [
        [
            "What''s the difference between a hippo and a zippo? One is really heavy and the other is a little lighter!",
            "What’s the difference between a hippo and a zippo? One is really heavy and the other is a little lighter"
        ],
        0.15,
        [
            570,
            734
        ]
    ],
    [
        [
            "What do you call the wife of a hippie? A Mississippi!",
            "What do you call the wife of a hippie? A Mississippi"
        ],
        0.07692307692307693,
        [
            578,
            758
        ]
    ],
    [
        [
            "Somebody stole all my lamps….and I couldn''t be more de-lighted!",
            "Somebody stole all my lamps… I couldn’t be more de-lighted!"
        ],
        0.26666666666666666,
        [
            588,
            796
        ]
    ],
    [
        [
            "Did you hear about that cheese factory that exploded in France? There was nothing left but de Brie!",
            "Did you hear about the cheese factory that exploded in France? There was nothing left but de Brie"
        ],
        0.1,
        [
            591,
            813
        ]
    ],
    [
        [
            "Three conspiracy theorists walk into a bar…You can''t tell me that''s just a coincidence!",
            "Three conspiracy theorists walk into a bar You can''t tell me that''s just a coincidence ."
        ],
        0.25,
        [
            594,
            2016
        ]
    ],
    [
        [
            "Time flies like an arrow… Fruit flies like a banana!",
            "Time flies like an arrow. Fruit flies like a banana."
        ],
        0.36363636363636365,
        [
            597,
            1639
        ]
    ],
    [
        [
            "I have a few jokes about unemployed people… But none of them work!",
            "I have a few jokes about unemployed people, but none of them work"
        ],
        0.35294117647058826,
        [
            602,
            725
        ]
    ],
    [
        [
            "A police officer just knocked on my door and told me my dogs are chasing people on bikes. That''s ridiculous. My dogs don''t even own bikes!",
            "A police officer just knocked on my door and told me my dogs are chasing people on bikes. That’s ridiculous. My dogs don’t even own bikes"
        ],
        0.10714285714285714,
        [
            612,
            746
        ]
    ],
    [
        [
            "My dad unfortunately passed away when we couldn''t remember his blood type… His last words to us were, \"Be positive!\"",
            "My dad, unfortunately, passed away when we couldn’t remember his blood type… His last words to us were, “Be positive!”"
        ],
        0.17857142857142858,
        [
            615,
            757
        ]
    ],
    [
        [
            "Did you hear about the guy who got hit in the head with a can of soda? He was lucky it was a soft drink!",
            "Did you hear about the guy who got hit in the head with a can of soda? He was lucky it was a soft drink."
        ],
        0.08,
        [
            620,
            1618
        ]
    ],
    [
        [
            "I saw an ad for burial plots, and I thought… \"That''s the last thing I need!\"",
            "I saw an ad for burial plots, and I thought: “That’s the last thing I need!”"
        ],
        0.3333333333333333,
        [
            621,
            772
        ]
    ],
    [
        [
            "I can''t believe I got fired from the calendar factory. All I did was take a day off!",
            "I can’t believe I got fired from the calendar factory. All I did was take a day off"
        ],
        0.15,
        [
            622,
            737
        ]
    ],
    [
        [
            "I can''t believe I got fired from the calendar factory. All I did was take a day off!",
            "I can''t believe I got fired from the calendar factory. All I did was take a day off."
        ],
        0.1,
        [
            622,
            1622
        ]
    ],
    [
        [
            "How do you make holy water? You boil the hell out of it.",
            "How do you make holy water? You boil the hell out of it"
        ],
        0.06666666666666667,
        [
            628,
            727
        ]
    ],
    [
        [
            "I bought some shoes from a drug dealer. I don''t know what he laced them with, but I was tripping all day!",
            "I bought shoes from a drug dealer once I don''t know what he laced them with, but I was tripping all day"
        ],
        0.19230769230769232,
        [
            629,
            844
        ]
    ],
    [
        [
            "What do you call someone with no body and no nose? Nobody knows.",
            "What do you call somebody with no body and no nose? Nobody knows"
        ],
        0.2,
        [
            633,
            841
        ]
    ],
    [
        [
            "My friend keeps saying \"cheer up man it could be worse, you could be stuck underground in a hole full of water.\" I know he means well.",
            "My friend keeps saying \"cheer up man it could be worse, you could be stuck underground in a hole full of water\" I know he means well..."
        ],
        0.12903225806451613,
        [
            640,
            4321
        ]
    ],
    [
        [
            "Justice is a dish best served cold, if it were served warm it would be justwater.",
            "Justice is a dish best served cold because... ...if it were served warm, it would be justwater."
        ],
        0.1111111111111111,
        [
            641,
            4253
        ]
    ],
    [
        [
            "Why can''t you hear a pterodactyl go to the bathroom? Because the pee is silent.",
            "Why can''t you hear a pterodactyl go to the bathroom? Because the pee is silent"
        ],
        0.05555555555555555,
        [
            644,
            848
        ]
    ],
    [
        [
            "3 unwritten rules of life...1. 2. 3.",
            "The three unwritten rules of life 1.\n 2.\n 3."
        ],
        0.2727272727272727,
        [
            647,
            2644
        ]
    ],
    [
        [
            "Don''t trust atoms. They make up everything!",
            "Don''t trust atoms They make up everything"
        ],
        0.2727272727272727,
        [
            650,
            839
        ]
    ],
    [
        [
            "Why couldn''t the bike standup by itself? It was two tired.",
            "Why couldn''t the bicycle stand up by itself? It was two tired"
        ],
        0.3333333333333333,
        [
            663,
            826
        ]
    ],
    [
        [
            "What do you call a deer with no eyes? No idea!",
            "What do you call a deer with no eyes? No idea"
        ],
        0.07692307692307693,
        [
            664,
            830
        ]
    ],
    [
        [
            "A termite walks into a bar and asks, \"Is the bar tender here?\"",
            "A termite walks into a bar and says, \"Where is the bar tender?\""
        ],
        0.3157894736842105,
        [
            672,
            1623
        ]
    ],
    [
        [
            "Can February March? No, but April May!",
            "Can February March? No, but April May"
        ],
        0.1,
        [
            678,
            837
        ]
    ],
    [
        [
            "What do you get when you cross a snowman with a vampire? Frostbite.",
            "What do you get when you cross a snowman with a vampire Frostbite"
        ],
        0.15384615384615385,
        [
            700,
            824
        ]
    ],
    [
        [
            "What do prisoners use to call each other? Cell phones.",
            "What do prisoners use to call each other? Cell phones"
        ],
        0.08333333333333333,
        [
            718,
            822
        ]
    ],
    [
        [
            "I Renamed my iPod The Titanic, so when I plug it in, it says “The Titanic is syncing.”",
            "I Renamed my iPod The Titanic, so when I plug it in, it says, “The \u2028Titanic is syncing.”\n\nSource: textsfromlastnight.com"
        ],
        0.2727272727272727,
        [
            729,
            1747
        ]
    ],
    [
        [
            "Last night, I dreamed I was swimming in an ocean of orange soda. But it was just a Fanta sea",
            "Last night, I dreamed I was swimming in an ocean of orange soda. But it was just a Fanta sea.\n (Credit: justbadpuns on tumblr)"
        ],
        0.3333333333333333,
        [
            731,
            1596
        ]
    ],
    [
        [
            "I lost my job at the bank on my very first day. A woman asked me to check her balance, so I pushed her over",
            "I lost my job at the bank on my very first day.  A woman asked me to check her balance, so I pushed her over."
        ],
        0.041666666666666664,
        [
            733,
            1606
        ]
    ],
    [
        [
            "Two windmills are standing in a wind farm. One asks, “What’s your favorite kind of music?” The other says, “I’m a big metal fan.”",
            "Two windmills are standing in a wind farm. One asks, \"What''s your favorite kind of music?\" The other says, \"I''m a big metal fan.\""
        ],
        0.15151515151515152,
        [
            735,
            1594
        ]
    ],
    [
        [
            "I can’t believe I got fired from the calendar factory. All I did was take a day off",
            "I can''t believe I got fired from the calendar factory. All I did was take a day off."
        ],
        0.15,
        [
            737,
            1622
        ]
    ],
    [
        [
            "I went to buy some camouflage trousers yesterday but couldn''t find any",
            "I went to buy some camouflage trousers the other day but I couldn''t find any."
        ],
        0.2777777777777778,
        [
            740,
            1683
        ]
    ],
    [
        [
            "What do you call a bee that can’t make up its mind? A maybe",
            "What do you call a bee that can''t make up its mind? A Maybe"
        ],
        0.21052631578947367,
        [
            741,
            1567
        ]
    ],
    [
        [
            "Hear about the new restaurant called Karma? There’s no menu - you get what you deserve",
            "Hear about the new restaurant called Karma?\n\nThere’s no menu—you get what you deserve."
        ],
        0.2,
        [
            742,
            1749
        ]
    ],
    [
        [
            "I tried to sue the airline for losing my luggage. I lost my case",
            "I tried to sue the airport for misplacing my luggage. – I lost my case."
        ],
        0.375,
        [
            743,
            1673
        ]
    ],
    [
        [
            "I wasn’t originally going to get a brain transplant, but then I changed my mind",
            "I wasn''t originally going to get a brain transplant, but then I changed my mind."
        ],
        0.15789473684210525,
        [
            759,
            1621
        ]
    ],
    [
        [
            "Which country’s capital has the fastest-growing population? Ireland. Every day it’s Dublin.",
            "Q. Which country''s capital has the fastest-growing population?\n A. Ireland. Every day it''s Dublin."
        ],
        0.21052631578947367,
        [
            760,
            1557
        ]
    ],
    [
        [
            "How do you throw a space party? You planet",
            "Q: How do you organize a space party?\n A: You planet"
        ],
        0.35714285714285715,
        [
            763,
            1586
        ]
    ],
    [
        [
            "I hate how funerals are always at 9 a.m. I’m not really a mourning person",
            "I hate how funerals are always at 9 a.m.  I’m not really a mourning person."
        ],
        0.058823529411764705,
        [
            769,
            1605
        ]
    ],
    [
        [
            "What’s the difference between a poorly dressed man on a bicycle and a nicely dressed man on a tricycle? A tire",
            "What’s the difference between a  poorly dressed man on a unicycle and a well-dressed man on a bicycle?\n Attire."
        ],
        0.36363636363636365,
        [
            770,
            1550
        ]
    ],
    [
        [
            "What’s the difference between a poorly dressed man on a bicycle and a nicely dressed man on a tricycle? A tire",
            "What''s the difference between a poorly dressed man on a bicycle and a nicely dressed man on a tricycle? A tire."
        ],
        0.15,
        [
            770,
            1625
        ]
    ],
    [
        [
            "What do you call an alligator in a vest? An investigator",
            "Q: What do you call and alligator in a vest?\n A: An investigator"
        ],
        0.3125,
        [
            777,
            1588
        ]
    ],
    [
        [
            "Police were called to a daycare center where a three-year-old was resisting a rest",
            "Police were called to a daycare center where a three-year-old was resisting a rest."
        ],
        0.07692307692307693,
        [
            784,
            1638
        ]
    ],
    [
        [
            "The machine at the coin factory just suddenly stopped working, with no explanation. It doesn’t make any cents",
            "The machine at the coin factory just suddenly stopped working, with no explanation. It doesn''t make any cents!"
        ],
        0.13043478260869565,
        [
            788,
            1560
        ]
    ],
    [
        [
            "Why are frogs so happy? They eat whatever bugs them",
            "Q: Why are frogs so happy?\n\nA: They eat whatever bugs them."
        ],
        0.26666666666666666,
        [
            789,
            1777
        ]
    ],
    [
        [
            "Why aren’t dogs good dancers? Because they have two left feet!",
            "Q: Why aren''t dogs good dancers?\n\nA: Because they have two left feet!"
        ],
        0.2631578947368421,
        [
            793,
            1787
        ]
    ],
    [
        [
            "Why is the number six afraid of seven? Because seven ate nine",
            "Q: Why is the number six afraid of seven?\n\nA: Because seven ate nine!"
        ],
        0.25,
        [
            794,
            1802
        ]
    ],
    [
        [
            "What do you call cheese that isn''t yours? Nacho Cheese",
            "Q: What do you call cheese that isn’t yours?\n A: Nacho cheese!"
        ],
        0.3888888888888889,
        [
            823,
            1645
        ]
    ],
    [
        [
            "What lies at the bottom of the ocean and twitches? A nervous wreck",
            "Q. What lies at the bottom of the ocean and twitches?\n A. A nervous wreck."
        ],
        0.1875,
        [
            825,
            1552
        ]
    ],
    [
        [
            "Are you religious? Because you''re the answer to all my prayers.",
            "Are you religious? Cause you’re the answer to all my prayers."
        ],
        0.25,
        [
            922,
            1221
        ]
    ],
    [
        [
            "If you were a vegetable you''d be a cute-cumber.",
            "If you were a vegetable you''d be a cutecumber."
        ],
        0.18181818181818182,
        [
            926,
            1299
        ]
    ],
    [
        [
            "Let me tie your shoes, cause I don''t want you falling for anyone else.",
            "Hey, tie your shoes! I don’t want you falling for anyone else."
        ],
        0.3333333333333333,
        [
            931,
            1222
        ]
    ],
    [
        [
            "Do you have a sunburn, or are you always this hot?",
            "Do you have a tan, or do you always look this hot?"
        ],
        0.3333333333333333,
        [
            945,
            1277
        ]
    ],
    [
        [
            "Are you a parking ticket? ''Cause you''ve got fine written all over you.",
            "Are you a parking ticket? ‘Cause you’ve got fine written all over you."
        ],
        0.2222222222222222,
        [
            954,
            1243
        ]
    ],
    [
        [
            "I''m not drunk, I''m just intoxicated by YOU.",
            "I’m not drunk, I’m just intoxicated by you."
        ],
        0.3076923076923077,
        [
            973,
            1290
        ]
    ],
    [
        [
            "Have you been to the doctor lately? Cause I think you''re lacking some Vitamin Me.",
            "Have you been to the doctor''s lately? Cause I think you''re lacking some vitamin me."
        ],
        0.23809523809523808,
        [
            980,
            1264
        ]
    ],
    [
        [
            "Are you from Tennessee? Because you''re the only ten I see!",
            "Are you from Tennessee? Because you''re the only 10 I see!"
        ],
        0.13333333333333333,
        [
            1032,
            1235
        ]
    ],
    [
        [
            "Is your dad a terrorist? Because you are the bomb!",
            "Is your dad a terrorist? Because you are the bomb."
        ],
        0.15384615384615385,
        [
            1035,
            1286
        ]
    ],
    [
        [
            "When God made you, he was showing off.",
            "Wow, when god made you he was showing off."
        ],
        0.38461538461538464,
        [
            1046,
            1273
        ]
    ],
    [
        [
            "Your lips look so lonely.... Would they like to meet mine?",
            "Your lips look so lonely…Would they like to meet mine?"
        ],
        0.3333333333333333,
        [
            1055,
            1242
        ]
    ],
    [
        [
            "My love for you is like diarrhea, I just can''t hold it in.",
            "My love for you is like diarrhoea, I just can''t hold it in."
        ],
        0.1111111111111111,
        [
            1056,
            1229
        ]
    ],
    [
        [
            "Wouldn''t we look cute on a wedding cake together?",
            "Wouldn''t we look cute on a wedding cake together."
        ],
        0.15384615384615385,
        [
            1064,
            1285
        ]
    ],
    [
        [
            "I may not be a genie, but I can make your dreams come true.",
            "I may not be a genie, but I can make all your wishes come true!"
        ],
        0.2777777777777778,
        [
            1066,
            1289
        ]
    ],
    [
        [
            "Life without you would be like a broken pencil... pointless.",
            "Life without you is like a broken pencil... pointless."
        ],
        0.23076923076923078,
        [
            1085,
            1237
        ]
    ],
    [
        [
            "Does your left eye hurt? Because you''ve been looking right all day.",
            "Does your left eye hurt? Because you’ve been looking right all day."
        ],
        0.11764705882352941,
        [
            1210,
            1271
        ]
    ],
    [
        [
            "Do you have a name or can I just call you mine?",
            "Do you have a name, or can I call you mine?"
        ],
        0.15384615384615385,
        [
            1212,
            1283
        ]
    ],
    [
        [
            "I''m new in town. Could you give me directions to your apartment?",
            "I''m new in town, could you give me directions to your apartment?"
        ],
        0.2777777777777778,
        [
            1232,
            1312
        ]
    ],
    [
        [
            "Pinch me, you’re so fine I must be dreaming.",
            "Can you pinch me, because you''re so fine I must be dreaming."
        ],
        0.35294117647058826,
        [
            1248,
            1288
        ]
    ],
    [
        [
            "Q: What did the femur say to the patella?\n A: I kneed you",
            "Q: What did the volcano say to his wife?\n A: I lava you"
        ],
        0.3888888888888889,
        [
            1341,
            1580
        ]
    ],
    [
        [
            "Q: Why can you never trust atoms?\n A: They make up everything!",
            "Q: Why can''t you trust an atom?\n A: They make up everything"
        ],
        0.3684210526315789,
        [
            1423,
            1517
        ]
    ],
    [
        [
            "Q: What did the chemist snack on during lunch?\n A: A ''gram'' cracker.",
            "Q: What did the physicist snack on during lunch?\n A: A ''gram'' cracker."
        ],
        0.1111111111111111,
        [
            1458,
            1504
        ]
    ],
    [
        [
            "Q: How many theoretical physicists does it take to change a light bulb?\n A: Two... One to hold the bulb and the other to rotate the universe.",
            "Q: How many physicists does it take to change a light bulb?\n A: Eleven. One to do it and ten to co-author the paper."
        ],
        0.3870967741935484,
        [
            1515,
            1525
        ]
    ],
    [
        [
            "What’s the difference between a  poorly dressed man on a unicycle and a well-dressed man on a bicycle?\n Attire.",
            "What''s the difference between a poorly dressed man on a bicycle and a nicely dressed man on a tricycle? A tire."
        ],
        0.391304347826087,
        [
            1550,
            1625
        ]
    ],
    [
        [
            "What do you call a pig that does karate? Pork chop",
            "Q: What do you call a pig that does karate?\n A: Pork chop"
        ],
        0.2,
        [
            1568,
            1575
        ]
    ],
    [
        [
            "Becoming a vegetarian is a big missed steak.",
            "Becoming a vegetarian is a huge missed steak."
        ],
        0.2222222222222222,
        [
            1587,
            1628
        ]
    ],
    [
        [
            "Did you hear about the man who was accidentally buried alive?  It was a grave mistake.",
            "Did you hear about the man who was accidentally buried alive? – It was a grave mistake."
        ],
        0.05555555555555555,
        [
            1602,
            1674
        ]
    ],
    [
        [
            "I had to clean out my spice rack and found everything was too old and had to be thrown out.  What a waste of thyme.",
            "I had to clean out my spice rack and found everything was too old and had to be thrown out. – What a waste of thyme."
        ],
        0.041666666666666664,
        [
            1603,
            1670
        ]
    ],
    [
        [
            "6:30 is the best time on a clock… hands down.",
            "6:30 is the best time on a clock hands down"
        ],
        0.25,
        [
            1604,
            4066
        ]
    ],
    [
        [
            "Did you hear about the mathematician who was afraid of negative numbers? He''d stop at nothing to avoid them.",
            "Q: Did you hear about the mathematician who’s afraid of negative numbers?\n\nA: He will stop at nothing to avoid them."
        ],
        0.3103448275862069,
        [
            1635,
            1758
        ]
    ],
    [
        [
            "Did you hear about the mathematician who was afraid of negative numbers? He''d stop at nothing to avoid them.",
            "Did you hear about the mathematician who''s afraid of negative numbers? He''ll stop at nothing to avoid them."
        ],
        0.16,
        [
            1635,
            4272
        ]
    ],
    [
        [
            "Q: Why did the tomato blush?\n A: Because it saw the salad dressing.",
            "Why did the tomato blush? – Because it saw the salad dressing."
        ],
        0.25,
        [
            1641,
            1666
        ]
    ],
    [
        [
            "Two cannibals are eating a clown. One says to the other: \"Does this taste funny to you?\"",
            "Two cannibals are eating a clown. One cannibal turns to the other and asks, \"This taste funny to you?\""
        ],
        0.38461538461538464,
        [
            1684,
            1846
        ]
    ],
    [
        [
            "Did you hear about the weekly poker game with Vasco da Gama, Christopher Columbus, Leif Eriksson and Francisco Pizarro?\n\nThey can never seem to beat the Straights of Magellan.",
            "Did you hear about the weekly poker game with Vasco da Gama, Christopher Columbus, Leif Eriksson, and Francisco Pizarro?\n\nThey can never seem to beat the Straights of Magellan."
        ],
        0.0,
        [
            1750,
            1849
        ]
    ],
    [
        [
            "Q: Did you hear about the mathematician who’s afraid of negative numbers?\n\nA: He will stop at nothing to avoid them.",
            "Did you hear about the mathematician who''s afraid of negative numbers? He''ll stop at nothing to avoid them."
        ],
        0.25,
        [
            1758,
            4272
        ]
    ],
    [
        [
            "A Woman goes to buy a Parrot. The prices are $100, $200, and $15. She asks why the last one is so cheap? \"Because he used to live in a brothel\" says the shopkeeper. She pays $15.\n When she gets home the parrot says: \"Fuck me, a new brothel!\" The woman laughs.\n When her daughters get home the parrot says: \"Fuck me, 2 new prozzies!\" The girls laughs too.\n When the dad gets home the parrot says: \"Fuck me Pete, haven''t seen you for weeks!\"",
            "A Woman goes to buy a Parrot. The prices are $100, $200, and $15. She asks ‘Why is the last one so cheap?’ \"Because he used to live in a brothel\" says the shopkeeper. She pays $15.   \n    \n When she gets home the parrot says: \"Fuck me, a new brothel!\" The woman laughs.        \n When her daughters get home the parrot says: \"Fuck me, 2 new prozzies!\" The girls laugh too.          \n When the dad gets home the parrot says: \"Fuck me Pete, haven''t seen you for weeks!\""
        ],
        0.08695652173913043,
        [
            1944,
            4144
        ]
    ],
    [
        [
            "Call me a racist if you want, but south of the border is a sea of violence, corruption and stupidity I wouldn''t touch with a ten foot pole. I just thank my lucky stars I live in Canada.",
            "Call me a racist if you want, but south of the border is a sea of violence, corruption and stupidity I wouldn''t touch with a ten foot pole. I am thankful every day that I live in Canada."
        ],
        0.23809523809523808,
        [
            1946,
            4135
        ]
    ],
    [
        [
            "North Koreans believe they live in the best country in the world because they’re brainwashed by the government and the media. When every American knows that America is the best country in the world.",
            "North Koreans believe they live in the best country in the world because they’re brainwashed by the government and the media But every American knows that America is the best country in the world"
        ],
        0.17857142857142858,
        [
            1961,
            2325
        ]
    ],
    [
        [
            "My girlfriend dressed up as a policewoman and told me I was under arrest on suspicion of being good in bed. After 2 minutes all charges were dropped due to a lack of evidence.",
            "My girlfriend dressed up as a policewoman and told me I was under arrest on suspicion of being good in bed. After 2 minutes all charges were dropped due to a lack of evidence"
        ],
        0.030303030303030304,
        [
            1968,
            2198
        ]
    ],
    [
        [
            "My girlfriend dressed up as a policewoman and told me I was under arrest on suspicion of being good in bed. After 2 minutes all charges were dropped due to a lack of evidence.",
            "My girlfriend dressed up as a policewoman and told me I was under arrest on suspicion of being too good in bed... After 2 minutes, all charges were dropped due to a lack of evidence."
        ],
        0.13513513513513514,
        [
            1968,
            2356
        ]
    ],
    [
        [
            "A lost dog strays into a jungle. A lion sees this from a distance and says with caution \"this guy looks edible, never seen his kind before\". So the lion starts rushing towards the dog with menace. The dog notices and starts to panic but as he''s about to run he sees some bones next to him and gets an idea and says loudly \"mmm...that was some good lion meat!\". \n The lion abruptly stops and says \" woah! This guy seems tougher then he looks, I better leave while I can\". \n Over by the tree top, a monkey witnessed everything. Evidently, the monkey realizes the he can benefit from this situation by telling the lion and getting something in return. So the monkey proceeds to tell the lion what really happened and the lion says angrily \"get on my back, we''ll get him together\". \n So they start rushing back to the dog. The dog sees them and realized what happened and starts to panic even more. He then gets another idea and shouts \"where the hell is that monkey! I told him to bring me another lion an hour ago...\"",
            "A lost dog strays into a jungle. A lion sees this from a distance and says with caution \"this guy looks edible, never seen his kind before\". So the lion starts rushing towards the dog with menace. The dog notices and starts to panic but as he''s about to run he sees some bones next to him and gets an idea and says loudly \"mmm...that was some good lion meat!\".\n The lion abruptly stops and says \" woah! This guy seems tougher then he looks, I better leave while I can\".\n Over by the tree top, a monkey witnessed everything. Evidently, the monkey realizes the he can benefit from this situation by telling the lion and getting something in return. So the monkey proceeds to tell the lion what really happened and the lion says angrily \"get on my back, we''ll get him together\".\n So they start rushing back to the dog. The dog sees them and realized what happened and starts to panic even more. He then gets another idea and shouts \"where the hell is that monkey! I told him to bring me another lion an hour ago...\""
        ],
        0.0,
        [
            1970,
            4208
        ]
    ],
    [
        [
            "If I had a dollar for every time someone over 40 told me my generation sucks... Then I could afford a house in the economy they ruined.",
            "If I had a dollar for everytime someone over 40 told me my generation sucks.... Then I could afford a house in the economy they ruined."
        ],
        0.10714285714285714,
        [
            1975,
            3034
        ]
    ],
    [
        [
            "A man walks into a bar... The bartender asks \"Why the long face?\" \n The man replies \"I just found out my wife is sleeping with another man. I''ve decided I''m going to drink myself to death.\" \n The bartender looks shocked and says \"I''m sorry I can''t help you kill yourself.\" \n The man asks \"Well what would you do in my situation?\"\n The bartender puffs himself up a bit and says \"If I found out a guy was sleeping with my wife I wouldn''t sit around feeling sorry for myself, I''d kill the guy.\"\n The man jumps up from his stool and shouts \"That''s a great idea! Thanks!\" and runs out of the bar.\n A couple hours goes by and the bartender is starting to get nervous when the man walks back into the bar with a smile on his face.\n \"Did you kill the guy?\" The bartender asks nervously.\n \"Nope! I slept with your wife. Whiskey please.\"",
            "A man finds out his wife is cheating on him... So he walks into a bar.\n The bartender asks \"Why are you looking so blue?\"\n The man replies \"I just found out my wife is cheating on me. I''ve decided I''m going to drink myself to death. I''ll have some whiskey please.\"\n The bartender looks shocked and says \"I''m sorry, but I can''t help you kill yourself.\"\n The man asks \"Well what would you do in my situation?\"\n The bartender thinks for a bit and says \"If I found out a guy was sleeping with my wife I wouldn''t sit around feeling sorry for myself, I''d kill the guy.\"\n The man jumps up from his stool and shouts \"That''s a great idea! Thanks!\" and runs out of the bar.\n A couple hours goes by and the bartender is starting to get nervous. Suddenly the man walks back into the bar with a big smile on his face.\n \"Did you kill the guy?\" The bartender asks nervously.\n \"Nope! I slept with your wife. Whiskey please.\""
        ],
        0.22580645161290322,
        [
            1985,
            4102
        ]
    ],
    [
        [
            "As an Aussie, Americans are always asking me where in Australia there *isn’t* something trying to kill you... “School” is my answer ",
            "As an Aussie, Americans are always asking me where in Australia there *isn’t* something trying to kill you... “School” is my answer"
        ],
        0.0,
        [
            2004,
            2050
        ]
    ],
    [
        [
            "As an Aussie, Americans are always asking me where in Australia there *isn’t* something trying to kill you... “School” is my answer ",
            "As an Aussie, Americans are always asking me where in Australia there \"isn''t\" something trying to kill you.... \"School\" is my answer."
        ],
        0.30303030303030304,
        [
            2004,
            2430
        ]
    ],
    [
        [
            "A professor, a CEO, and a janitor are in a forest when they discover a magic fairy. The fairy says \"I will give you what you most desire if you do someone else''s job for a day.\"\n The professor says \"I''ll be an elementary school teacher. What can be so hard about teaching a bunch of 6-year-olds how to read?\" so he is teleported into a classroom. After a few minutes, all the kids'' screaming gets to his nerves, so he throws all his supplies and gives up.\n The C.E.O says \"I''ll be a waiter. All you do is carry food back and forth. This''ll be a breeze\" so he is teleported to a restaurant. After about an hour, all the annoying customers drive him insane, so he smashes his plates on the ground and gives up.\n The janitor says \"I''ll be an artist\" so he is transported to an art facility. He glues all the classroom supplies and shattered plates to a canvas, then sells it for a billion dollars. The fairy asks the janitor how he was so clever.\n The janitor says \"I got a masters degree in art.\"",
            "A professor, a CEO, and a janitor are in a forest when they discover a magic fairy. The fairy says “I will give you what you most desire if you do someone else’s job for a day.”\n The professor says “I’ll be an elementary school teacher. What can be so hard about teaching a bunch of 6-year-olds how to read?” so he is teleported into a classroom. After a few minutes, all the kids’ screaming gets to his nerves, so he throws all his supplies and gives up.\n The C.E.O says “I’ll be a waiter. All you do is carry food back and forth. This’ll be a breeze” so he is teleported to a restaurant. After about an hour, all the annoying customers drive him insane, so he smashes his plates on the ground and gives up.\n The janitor says “I’ll be an artist” so he is transported to an art facility. He glues all the classroom supplies and shattered plates to a canvas, then sells it for a billion dollars. The fairy asks the janitor how he was so clever.\n The janitor says “I got a masters degree in art.”"
        ],
        0.042735042735042736,
        [
            2012,
            2350
        ]
    ],
    [
        [
            "A professor, a CEO, and a janitor are in a forest when they discover a magic fairy. The fairy says \"I will give you what you most desire if you do someone else''s job for a day.\"\n The professor says \"I''ll be an elementary school teacher. What can be so hard about teaching a bunch of 6-year-olds how to read?\" so he is teleported into a classroom. After a few minutes, all the kids'' screaming gets to his nerves, so he throws all his supplies and gives up.\n The C.E.O says \"I''ll be a waiter. All you do is carry food back and forth. This''ll be a breeze\" so he is teleported to a restaurant. After about an hour, all the annoying customers drive him insane, so he smashes his plates on the ground and gives up.\n The janitor says \"I''ll be an artist\" so he is transported to an art facility. He glues all the classroom supplies and shattered plates to a canvas, then sells it for a billion dollars. The fairy asks the janitor how he was so clever.\n The janitor says \"I got a masters degree in art.\"",
            "A professor, a CEO, and a janitor are in a forest when they discover a magic fairy.  The fairy says \"I will give you what you most desire if you do someone else''s job for a day.\"\n The professor says \"I''ll be an elementary school teacher. What can be so hard about teaching a bunch of 6-year-olds how to read?\" so he is teleported into a classroom. After a few minutes, all the kids'' screaming gets to his nerves, so he throws all his supplies and gives up.\n The C.E.O says \"I''ll be a waiter. All you do is carry food back and forth. This''ll be a breeze\" so he is teleported to a restaurant. After about an hour, all the annoying customers drive him insane, so he smashes his plates on the ground and gives up.\n The janitor says \"I''ll be an artist\" so he is transported to an art facility. He glues all the classroom supplies and shattered plates to a canvas, then sells it for a billion dollars. The fairy asks the janitor how he was so clever.\n The janitor says \"I got a masters degree in art.\""
        ],
        0.0,
        [
            2012,
            2401
        ]
    ],
    [
        [
            "An infinite number of mathematicians walk into a bar The first mathematician orders a beer\n The second orders half a beer\n \"I don''t serve half-beers\" the bartender replies\n \"Excuse me?\" Asks mathematician #2\n \"What kind of bar serves half-beers?\" The bartender remarks. \"That''s ridiculous.\"\n \"Oh c''mon\" says mathematician #1 \"do you know how hard it is to collect an infinite number of us? Just play along\"\n \"There are very strict laws on how I can serve drinks. I couldn''t serve you half a beer even if I wanted to.\"\n \"But that''s not a problem\" mathematician #3 chimes in \"at the end of the joke you serve us a whole number of beers. You see, when you take the sum of a continuously halving function-\"\n \"I know how limits work\" interjects the bartender\n \"Oh, alright then. I didn''t want to assume a bartender would be familiar with such advanced mathematics\"\n \"Are you kidding me?\" The bartender replies, \"you learn limits in like, 9th grade! What kind of mathematician thinks limits are advanced mathematics?\"\n \"HE''S ON TO US\" mathematician #1 screeches\n Simultaneously, every mathematician opens their mouth and out pours a cloud of multicolored mosquitoes. Each mathematician is bellowing insects of a different shade.\n The mosquitoes form into a singular, polychromatic swarm. \"FOOLS\" it booms in unison, \"I WILL INFECT EVERY BEING ON THIS PATHETIC PLANET WITH MALARIA\"\n The bartender stands fearless against the technicolor hoard. \"But wait\" he inturrupts, thinking fast, \"if you do that, politicians will use the catastrophe as an excuse to implement free healthcare. Think of how much that will hurt the taxpayers!\"\n The mosquitoes fall silent for a brief moment. \"My God, you''re right. We didn''t think about the economy! Very well, we will not attack this dimension. FOR THE TAXPAYERS!\" and with that, they vanish.\n A nearby barfly stumbles over to the bartender. \"How did you know that that would work?\"\n \"It''s simple really\" the bartender says. \"I saw that the vectors formed a gradient, and therefore must be conservative.\"",
            "An infinite number of mathematicians walk into a bar The first mathematician orders a beer\n The second orders half a beer\n \"I don''t serve half-beers\" the bartender replies\n \"Excuse me?\" Asks mathematician #2\n \"What kind of bar serves half-beers?\" The bartender remarks. \"That''s ridiculous.\"\n \"Oh c''mon\" says mathematician #1 \"do you know how hard it is to collect an infinite number of us? Just play along\"\n \"There are very strict laws on how I can serve drinks. I couldn''t serve you half a beer even if I wanted to.\"\n \"But that''s not a problem\" mathematician #3 chimes in \"at the end of the joke you serve us a whole number of beers. You see, when you take the sum of a continuously halving function-\"\n \"I know how limits work\" interjects the bartender\n \"Oh, alright then. I didn''t want to assume a bartender would be familiar with such advanced mathematics\"\n \"Are you kidding me?\" The bartender replies, \"you learn limits in like, 9th grade! What kind of mathematician thinks limits are advanced mathematics?\"\n \"HE''S ON TO US\" mathematician #1 screeches\n Simultaneously, every mathematician opens their mouth and out pours a cloud of multicolored mosquitoes. Each mathematician is bellowing insects of a different shade.\n The mosquitoes form into a singular, polychromatic swarm. \"FOOLS\" it booms in unison, \"I WILL INFECT EVERY BEING ON THIS PATHETIC PLANET WITH MALARIA\"\n The bartender stands fearless against the technicolor hoard. \"But wait\" he inturrupts, thinking fast, \"if you do that, politicians will use the catastrophe as an excuse to implement free healthcare. Think of how much that will hurt the taxpayers!\"\n The mosquitoes fall silent for a brief moment. \"My God, you''re right. We didn''t think about the economy! Very well, we will not attack this dimension. FOR THE TAXPAYERS!\" and with that, they vanish.\n A nearby barfly stumbles over to the bartender. \"How did you know that that would work?\"\n \"It''s simple really\" the bartender says. \"I saw that the vectors formed a gradient, and therefore must be conservative.\"\n "
        ],
        0.0,
        [
            2015,
            2474
        ]
    ],
    [
        [
            "NSFW - A mother was walking down the hall when she heard a humming sound coming from her daughter''s bedroom. When she opened the door she found her daughter naked on the bed with a vibrator. What are you doing?\" she exclaimed. \n The daughter replied, \"I''m 35 and still living at home with my parents and this is the closest I''ll ever get to a husband.\"\n Later that week the father was in the kitchen and heard a humming sound coming from the basement. \n When he went downstairs, he found his daughter naked on the sofa with her vibrator. \n \"What are you doing?\" he exclaimed.\n The daughter replied, \"I''m 35 and still living at home with my parents and this is the closest I''ll ever get to a husband.\"\n A couple of days later the mother heard the humming sound again, this time in the living room. \n In there, she found her husband watching the Super Bowl on television with the vibrator buzzing away beside him.\n \"What are you doing?\" she exclaimed. \n He replied............\"Watching the game with my son-in-law.\"",
            "Daughter''s vibrator A mother was walking down the hall when she heard a humming sound coming from her daughter''s bedroom. \n When she opened the door she found her daughter naked on the bed with a vibrator. \n &nbsp;\n What are you doing?\" she exclaimed. \n &nbsp;\n The daughter replied, \"I''m 35 and still living at home with my parents and this is the closest I''ll ever get to a husband.\"\n &nbsp;\n Later that week the father was in the kitchen and heard a humming sound coming from the basement. \n When he went downstairs, he found his daughter naked on the sofa with her vibrator. \n &nbsp;\n \"What are you doing?\" he exclaimed.\n &nbsp;\n The daughter replied, \"I''m 35 and still living at home with my parents and this is the closest I''ll ever get to a husband.\"\n &nbsp;\n  \n A couple of days later the mother heard the humming sound again, this time in the living room. \n In there, she found her husband watching the Super Bowl on television with the vibrator buzzing away beside him.\n &nbsp;\n \"What are you doing?\" she exclaimed. \n &nbsp;\n He replied............\"Watching the game with my son-in-law.\""
        ],
        0.06,
        [
            2036,
            4039
        ]
    ],
    [
        [
            "If you rearrange the letters of POSTMEN... They become VERY ANGRY.",
            "If you rearrange the letters of POSTMEN they become VERY ANGRY"
        ],
        0.2857142857142857,
        [
            2045,
            4651
        ]
    ],
    [
        [
            "Why will the congress never impeach Trump? Because the republicans always insist on carrying a baby to full term.",
            "Why will congress never impeach Trump? Republicans always insist on carrying a baby to full term."
        ],
        0.19047619047619047,
        [
            2049,
            2074
        ]
    ],
    [
        [
            "As an Aussie, Americans are always asking me where in Australia there *isn’t* something trying to kill you... “School” is my answer",
            "As an Aussie, Americans are always asking me where in Australia there \"isn''t\" something trying to kill you.... \"School\" is my answer."
        ],
        0.30303030303030304,
        [
            2050,
            2430
        ]
    ],
    [
        [
            "CAN ADMINS OF THIS SUBREDDIT REDDIT DO A BETTER JOB OF MONITORING WHO IS ALLOWED IN HERE PLEASE?! WE HAVE A NEW MEMBER, A WOMAN. SHE’S BEEN PRIVATELY MESSAGING MEMBERS, SENDING THEM NAKED PICTURES OF HERSELF IN NASTY POSES ALONG WITH CLOSE UPS OF HER UNMENTIONABLES. SHE IS OFFERING AN IPHONE 8+ IN EXCHANGE FOR SEXUAL FAVORS. I AM ESPECIALLY BOTHERED BECAUSE IT TURNED OUT TO BE AN IPHONE 6 AND OBVIOUSLY SOMETHING''S WRONG WITH IT. IT''S SUPER SLOW AND THE CAPS LOCK IS STUCK ON.",
            "CAN THE ADMINS OF THIS GROUP DO A BETTER JOB OF MONITORING WHO IS ALLOWED IN HERE PLEASE?! WE HAVE A NEW MEMBER, AN ELDERLY MAN. HE''S BEEN PRIVATELY MESSAGING MEMBERS, SENDING THEM NAKED PICTURES OF HIMSELF IN NASTY POSES ALONG WITH CLOSE UPS OF HIS JUNK. HE IS OFFERING UP AN IPHONE X IN EXCHANGE FOR SEXUAL FAVORS. I AM ESPECIALLY BOTHERED BECAUSE IT TURNED OUT TO BE AN IPHONE 8 AND OBVIOUSLY SOMETHING''S WRONG WITH IT. IT''S SUPER SLOW AND THE CAPS LOCK IS STUCK ON."
        ],
        0.22727272727272727,
        [
            2072,
            2127
        ]
    ],
    [
        [
            "Jane always had a certain attraction to Tarzan. So during her questions about his life, she asked him how he had sex. \"Tarzan not know what is sex\" he replied.\n Jane then explained to him what sex was.\n Tarzan said ....\"Tarzan use knot hole in trunk of tree.\"\n Stunned by his response, Jane said: \"Tarzan you have it all wrong, you don''t shag a tree to get yourself off. Tell you what, I will show you how to do it properly.\"\n She took off her clothing and laid down on the ground.\n \"Here\" she said, pointing to her privates,\"you must put it in here.\"\n Tarzan removed his loin cloth, showing Jane his considerable manhood, stepped closer to her and kicked her as hard as he could in the crotch.\n Jane rolled around in agony for what seemed like an eternity.\n Eventually she managed to grasp for air and screamed: \"What the bloody hell did you do that for?\n \"Check for squirrel.\" he responds",
            "When Jane first met Tarzan in the jungle, she was instantly attracted to him and during her questions about his life, she asked him if he had ever had sex. \"Tarzan not know sex.\" he replied. \n Jane explained to him what it was.\n Tarzan said, \"Ohhh...Tarzan use knot hole in trunk of tree.\"\n Horrified, Jane said, \"Tarzan, you have it all wrong, but I will show you how to do it properly.\"\n She took off her clothing and lay down on the ground.\n \"Here.\" she said, pointing to her privates. \"You must put it in here.\"\n Tarzan removed his loin cloth, showing Jane his considerable manhood, stepped closer to her and kicked her right in the crotch!\n Jane rolled around in agony for what seemed like an eternity.\n Eventually, she managed to gasp for air and screamed, \"What did you do that for?!\"\n Tarzan replied, \"Check for squirrel.\""
        ],
        0.39568345323741005,
        [
            2077,
            2297
        ]
    ],
    [
        [
            "TIL that you can get dishonorably discharged from the Navy for boarding the wrong vessel just once Whoops, wrong sub",
            "TIL that you can get dishonorably discharged from the Navy for boarding the wrong vessel just once. Whoops, wrong sub"
        ],
        0.1,
        [
            2087,
            2333
        ]
    ],
    [
        [
            "Why condoms come in packs of 3, 6 and 12! A man walks into the pharmacy with his 8-year old son. \n They happen to walk by the condom display, and the boy asks, \"What are these, Dad?\"\n To which the man matter-of-factly replies, \"Those are called Condoms son. Men use them to have safe sex.\"\n \"Oh I see,\" replied the boy pensively. \"Yes, I''ve heard of that in health class at school.\" \n He looks over the display and picks up a package of \n 3 and asks, \"Why are there 3 in this package?\"\n The dad replies, \"Those are for high school boys, one\n For Friday, one for Saturday, and one for Sunday.\"\n \"Cool\" says the boy. He notices a 6 pack and asks, \"Then who are these for?\"\n \"Those are for college men,\" the dad answers, \"two\n For Friday, two for Saturday, and two for Sunday.\"\n \"WOW!\" exclaimed the boy, \"then who uses THESE?\" he asks, picking up a 12 pack. With a sigh and a tear in his eye, the dad replies. \n \"Those are for married men, son. One for January, one for February, one for March...\"",
            "A man walks into a drug store with his 8-year-old son. They happen to walk by the condom display, and the boy asks, \"What are these, Dad?\" The man matter-of-factly replies, \"Those are called condoms, son. Men use them to have safe sex.\" \"Oh I see,\" replied the boys pensively. \"Yes, I''ve heard of that in health class at school.\" He looks over the display and picks up a package of three and asks, \"Why are there three in this package.\" The dad replies, \"Those are for high-school boys. One for Friday, one for Saturday, and one for Sunday.\" \"Cool!\" says the boy. He notices a pack of six and asks \"Then who are these for?\" \"Those are for college men,\" the dad answers, \"Two for Friday, two for Saturday, and two for Sunday.\" \"WOW!\" exclaimed the boy. \"Then who uses these?\" he asks, picking up a 12-pack. With a sigh, the dad replied, \"Those are for married men. One for January, one for February, one for March.\" one for March.\""
        ],
        0.265625,
        [
            2094,
            5379
        ]
    ],
    [
        [
            "Me: What''s the wifi password? Bartender: You need to buy a drink first.\n Me: Okay, I''ll have a coke.\n Bartender: Is Pepsi okay?\n Me: Sure. How much is that?\n Bartender: $3.\n Me: There you go. So what''s the wifi password?\n Bartender: You need to buy a drink first. No spaces, all lowercase.",
            "Me : What''s the wifi password? Bartender : you need to buy a drink first.\n Me : Okay, I''ll have a coke.\n Bartender : Is Pepsi ok?\n Me : Sure, How much is that?\n Bartender : 3$\n Me : There you go. So what''s the wifi password?\n Bartender : you need to buy a drink first. No spaces, all lowercase."
        ],
        0.15217391304347827,
        [
            2117,
            4148
        ]
    ],
    [
        [
            "I got fired from my job because I kept asking my customers whether they would prefer “Smoking” or “Non-smoking”. &#x200B;\n Apparently the correct terms are “Cremation” and “Burial”.",
            "I got fired from my job because I kept asking my customers whether they would prefer “Smoking” or “Non-smoking”. Apparently the correct terms are “Cremation” and “Burial”."
        ],
        0.125,
        [
            2122,
            2347
        ]
    ],
    [
        [
            "''Forget everything you learned in college. You won''t need it working here.'' ''But I never went to college.''\n ''Well then, I''m sorry. You are underqualified to work here.''",
            "Forget everything you learned in college... ''Forget everything you learned in college. You won''t need it working here.''\n ''But I never went to college.''\n ''Well then, I''m sorry. You are underqualified to work here.''"
        ],
        0.12121212121212122,
        [
            2126,
            3276
        ]
    ],
    [
        [
            "''Forget everything you learned in college. You won''t need it working here.'' ''But I never went to college.''\n ''Well then, I''m sorry. You are underqualified to work here.''",
            "\"Forget everything you learned in college... \"Forget everything you learned in college. You won''t need it working here.\"\n \"But I never went to college.\"\n \"Well then, I''m sorry. You are underqualified to work here.\"\n "
        ],
        0.12121212121212122,
        [
            2126,
            3780
        ]
    ],
    [
        [
            "An 18 year old Italian girl tells her mom that she has missed her period for two months Very worried, the mother goes to the drugstore and buys a pregnancy kit. The test result shows that the girl is pregnant. Shouting, cursing, crying, the mother says, \"Who was the pig that did this to you? I want to know!\" \n The girl picks up the phone and makes a call. Half an hour later, a Ferrari stops in front of their house. A mature and distinguished man with gray hair and impeccably dressed in an Armani suit steps out of the of the Ferrari and enters the house. He sits in the living room with the father, mother, and the girl and tells them: \"Good morning, your daughter has informed me of the problem. I can''t marry her because of my personal family situation but I''ll take charge.\" \n \"I will pay all costs and provide for your daughter for the rest of her life.\" \"Additionally, if a girl is born, I will bequeath a Ferrari, a beach house, two retail stores, a townhouse, a beachfront villa, and a $2,000,000 bank account. If a boy is born, my legacy will be a couple of factories and a $4,000,000 bank account. If twins, they will receive a factory and $2,000,000 each. However, if there is a miscarriage, what do you suggest I do?\"\n At this point, the father, who had remained silent, places a hand firmly on the man''s shoulder and tells him, \"You fuck her again.\"",
            "An 18 year old Italian girl tells her mom that she has missed her period for two months. Very worried, the mother goes to the drugstore and buys a pregnancy kit. The test result shows that the girl is pregnant. Shouting, cursing, crying, the mother says, \"Who was the pig that did this to you? I want to know!\"\n The girl picks up the phone and makes a call. Half an hour later, a Ferrari stops in front of their house. A mature and distinguished man with gray hair and impeccably dressed in an Armani suit steps out of the of the Ferrari and enters the house. He sits in the living room with the father, mother, and the girl and tells them: \"Good morning, your daughter has informed me of the problem. I can''t marry her because of my personal family situation but I''ll take charge.\"\n \"I will pay all costs and provide for your daughter for the rest of her life.\" \"Additionally, if a girl is born, I will bequeath a Ferrari, a beach house, two retail stores, a townhouse, a beachfront villa, and a $2,000,000 bank account. If a boy is born, my legacy will be a couple of factories and a $4,000,000 bank account. If twins, they will receive a factory and $2,000,000 each. However, if there is a miscarriage, what do you suggest I do?\"\n At this point, the father, who had remained silent, places a hand firmly on the man''s shoulder and tells him, \"You fuck her again.\""
        ],
        0.011976047904191617,
        [
            2151,
            4094
        ]
    ],
    [
        [
            "Several centuries ago, the Pope decreed that all the Jews had to convert to Catholicism or leave Italy. There was a huge outcry from the Jewish community, so the Pope offered a deal. He''d have a religious debate with the leader of the Jewish community... If the Jews won, they could stay in Italy; if the Pope won, they''d have to convert or leave.\n The Jewish people met and picked an aged and wise Rabbi to represent them in the debate.\n However, as the Rabbi spoke no Italian, and the Pope spoke no Hebrew, they agreed that it would be a ''silent'' debate.\n On the chosen day, the Pope and the Rabbi sat opposite each other\n The Pope raised his hand and showed three fingers.\n The Rabbi looked back and raised one finger.\n Next, the Pope waved his finger around his head. The Rabbi pointed to the ground where he sat.\n The Pope brought out a communion wafer and a chalice of wine.\n The Rabbi pulled out an apple.\n With that, the Pope stood up and declared himself beaten and said that the Rabbi was too clever. The Jews could stay in Italy!\n Later the cardinals met with the Pope and asked him what had happened. The Pope said, ''First I held up three fingers to represent the Trinity. He responded by holding up a single finger to remind me there is still only one God common to both our beliefs.'' ''Then, I waved my finger around my head to show him that God was all around us. He responded by pointing to the ground to show that God was also right here with us.'' ''Finally, I pulled out the wine and wafer to show that God absolves us of all our sins. He pulled out an apple to remind me of the original sin.'' ''He bested me at every move and I could not continue!''\n Meanwhile, the Jewish community gathered to ask the Rabbi how he had won. ''I don''t have a clue!!!'' the Rabbi said. ''First, he told me that we had three days to get out of Italy, so I gave him the finger.'' Then he tells me that the whole country would be cleared of Jews, so I told him that we were staying right here. ''And then what?'' asked a woman. ''Who knows...'' said the Rabbi. ''He took out his lunch, so I took out mine!''",
            "Several centuries ago, the Pope decreed that all the Jews had to convert to Catholicism or leave Italy. There was a huge outcry from the Jewish community, so the Pope offered a deal. He''d have a religious debate with the leader of the Jewish community... If the Jews won, they could stay in Italy; if the Pope won, they''d have to convert or leave.\n The Jewish people met and picked an aged and wise Rabbi to represent them in the debate.\n However, as the Rabbi spoke no Italian, and the Pope spoke no Hebrew, they agreed that it would be a ''silent'' debate.\n On the chosen day, the Pope and the Rabbi sat opposite each other.\n The Pope raised his hand and showed three fingers.\n The Rabbi looked back and raised one finger.\n Next, the Pope waved his finger around his head.\n  The Rabbi pointed to the ground where he sat.\n The Pope brought out a communion wafer and a chalice of wine.\n The Rabbi pulled out an apple.\n With that, the Pope stood up and declared himself beaten and said that the Rabbi was too clever. \n The Jews could stay in Italy!\n Later the cardinals met with the Pope and asked him what had happened.\n  The Pope said, \"First I held up three fingers to represent the Trinity. He responded by holding up a single finger to remind me there is still only one God common to both our beliefs. Then, I waved my finger around my head to show him that God was all around us. He responded by pointing to the ground to show that God was also right here with us. Finally, I pulled out the wine and wafer to show that God absolves us of all our sins. He pulled out an apple to remind me of the original sin. He bested me at every move and I could not continue!\"\n Meanwhile, the Jewish community gathered to ask the Rabbi how he had won. \n \"I don''t have a clue!!!\" the Rabbi said.\n \"First, he told me that we had three days to get out of Italy, so I gave him the finger. Then he tells me that the whole country would be cleared of Jews, so I told him that we were staying right here.\"\n \"And then what?\" asked a woman.\n  \"Who knows!!\" said the Rabbi. \"He took out his lunch, so I took out mine!\""
        ],
        0.010101010101010102,
        [
            2163,
            4041
        ]
    ],
    [
        [
            "Several centuries ago, the Pope decreed that all the Jews had to convert to Catholicism or leave Italy. There was a huge outcry from the Jewish community, so the Pope offered a deal. He''d have a religious debate with the leader of the Jewish community... If the Jews won, they could stay in Italy; if the Pope won, they''d have to convert or leave.\n The Jewish people met and picked an aged and wise Rabbi to represent them in the debate.\n However, as the Rabbi spoke no Italian, and the Pope spoke no Hebrew, they agreed that it would be a ''silent'' debate.\n On the chosen day, the Pope and the Rabbi sat opposite each other\n The Pope raised his hand and showed three fingers.\n The Rabbi looked back and raised one finger.\n Next, the Pope waved his finger around his head. The Rabbi pointed to the ground where he sat.\n The Pope brought out a communion wafer and a chalice of wine.\n The Rabbi pulled out an apple.\n With that, the Pope stood up and declared himself beaten and said that the Rabbi was too clever. The Jews could stay in Italy!\n Later the cardinals met with the Pope and asked him what had happened. The Pope said, ''First I held up three fingers to represent the Trinity. He responded by holding up a single finger to remind me there is still only one God common to both our beliefs.'' ''Then, I waved my finger around my head to show him that God was all around us. He responded by pointing to the ground to show that God was also right here with us.'' ''Finally, I pulled out the wine and wafer to show that God absolves us of all our sins. He pulled out an apple to remind me of the original sin.'' ''He bested me at every move and I could not continue!''\n Meanwhile, the Jewish community gathered to ask the Rabbi how he had won. ''I don''t have a clue!!!'' the Rabbi said. ''First, he told me that we had three days to get out of Italy, so I gave him the finger.'' Then he tells me that the whole country would be cleared of Jews, so I told him that we were staying right here. ''And then what?'' asked a woman. ''Who knows...'' said the Rabbi. ''He took out his lunch, so I took out mine!''",
            "Several centuries ago, the Pope decreed that all the Jews had to convert to Catholicism or leave Italy. There was a huge outcry from the Jewish community, so the Pope offered a deal. He''d have a religious debate with the leader of the Jewish community... If the Jews won, they could stay in Italy; if the Pope won, they''d have to convert or leave.\n The Jewish people met and picked an aged and wise Rabbi to represent them in the debate.\n However, as the Rabbi spoke no Italian, and the Pope spoke no Hebrew, they agreed that it would be a ''silent'' debate.\n On the chosen day, the Pope and the Rabbi sat opposite each other.\n The Pope raised his hand and showed three fingers.\n The Rabbi looked back and raised one finger.\n Next, the Pope waved his finger around his head.\n The Rabbi pointed to the ground where he sat.\n The Pope brought out a communion wafer and a chalice of wine.\n The Rabbi pulled out an apple.\n With that, the Pope stood up and declared himself beaten and said that the Rabbi was too clever.\n The Jews could stay in Italy!\n Later the cardinals met with the Pope and asked him what had happened.\n The Pope said, \"First I held up three fingers to represent the Trinity. He responded by holding up a single finger to remind me there is still only one God common to both our beliefs. Then, I waved my finger around my head to show him that God was all around us. He responded by pointing to the ground to show that God was also right here with us. Finally, I pulled out the wine and wafer to show that God absolves us of all our sins. He pulled out an apple to remind me of the original sin. He bested me at every move and I could not continue!\"\n Meanwhile, the Jewish community gathered to ask the Rabbi how he had won.\n \"I don''t have a clue!!!\" the Rabbi said.\n \"First, he told me that we had three days to get out of Italy, so I gave him the finger. Then he tells me that the whole country would be cleared of Jews, so I told him that we were staying right here.\"\n \"And then what?\" asked a woman.\n \"Who knows!!\" said the Rabbi. \"He took out his lunch, so I took out mine!\""
        ],
        0.010101010101010102,
        [
            2163,
            4505
        ]
    ],
    [
        [
            "Call a girl beautiful 1,000 times and she won''t think twice... Call a girl fat once and she''ll always remember. \n Because elephants never forget",
            "Call a girl beautiful 1000 times and she wont think twice.. Call a girl fat once and she’ll always remember.\n Because elephants never forget"
        ],
        0.37037037037037035,
        [
            2164,
            4074
        ]
    ],
    [
        [
            "What’s the difference between a politician and a flying pig? The letter F.",
            "What''s the difference between a politician and a flying pig. \n The F"
        ],
        0.3888888888888889,
        [
            2194,
            2544
        ]
    ],
    [
        [
            "My girlfriend dressed up as a policewoman and told me I was under arrest on suspicion of being good in bed. After 2 minutes all charges were dropped due to a lack of evidence",
            "My girlfriend dressed up as a policewoman and told me I was under arrest on suspicion of being too good in bed... After 2 minutes, all charges were dropped due to a lack of evidence."
        ],
        0.16216216216216217,
        [
            2198,
            2356
        ]
    ],
    [
        [
            "I proposed my Russian girlfriend and she said Yes! For the wedding, my whole family and friends flew over to her home town of Moscow.\n It was a beautiful ceremony, however I did find some things strange. For instance, the priest never said, \"You may now kiss the bride\", but I just assumed it was purely an American thing and didn''t mind.\n Later during the reception, we were both starving and decided to head over to the buffet to get food. On the way we passed the drink table, where about six people were waiting to get a fruity drink from a bowl.\n As we passed, they all said in unison, \"You may now kiss the bride!\" My wife got giddy and gave me a big kiss, which I of course returned.\n As we walked away I asked, \"Why did *they* tell us to kiss and not the priest?\"\n My wife answered,\n \"In Soviet Russia, the punchline tells you!\"",
            "I proposed my russian girlfriend and she said yes  \n For the wedding, my whole family and friends flew over to her home town of Moscow.\n It was a beautiful ceremony, however I did find some things strange. For instance, the priest never said, \"You may now kiss the bride\", but I just assumed it was purely an American thing and didn''t mind.\n Later during the reception, we were both starving and decided to head over to the buffet to get food. On the way we passed the drink table, where about six people were waiting to get a fruity drink from a bowl.\n As we passed, they all said in unison, \"You may now kiss the bride!\" My wife got giddy and gave me a big kiss, which I of course returned.\n As we walked away I asked, \"Why did *they* tell us to kiss and not the priest?\"\n My wife answered,\n \"In Soviet Russia, the punchline tells you!\""
        ],
        0.034782608695652174,
        [
            2202,
            4042
        ]
    ],
    [
        [
            "One day in the future, Donald Trump has a heart-attack and dies. He immediately goes to Hell, where the devil is waiting for him.\n \"I don''t know what to do here,\" says the devil.\" You''re on my list, but I have no room for you.\n You definitely have to stay here, so I''ll tell you what I''m going to do. I''ve got three folks here who weren''t quite as bad as you.\n I''ll let one of them go, but you have to take their place. I''ll even let YOU decide who leaves.\"\n Donald thought that sounded pretty good, so the devil opened the door to the first room.\n In it was Barack Obama and a large pool of water. Barack kept diving in, and surfacing, empty handed. Over, and over he dived in and surfaced with nothing. Such was his fate in hell.\n \"No,\" Donald said. \"I don''t think so. I''m not a good swimmer and it would ruin my hair.\n I don''t think I could do that all day long.\"\n The devil led him to the door of the next room.\n In it was Al Gore with a sledge-hammer and a room full of rocks.\n All he did was swing that hammer, time after time after time.\n \"No, this is no good; I''ve got his problem with my shoulder.\n I would be in constant agony if all I could do was break rocks all day,\" commented Donald.\n The devil opened a third door. Through it, Donald saw Bill Clinton, lying on the bed, his arms tied over his head and his legs restrained in a spread-eagle pose. Bent over him was Monica Lewinsky, doing what she does best.\n Donald looked at this in shocked disbelief, and finally said, \"Yeah man, I can handle this.\"\n The devil smiled and said..........\n \"OK, Monica, you''re free to go.\"",
            "One day in the future, Donald Trump has a heart-attack and dies. He immediately goes to Hell, where the devil is waiting for him. \n \"I don''t know what to do here,\" says the devil.\n “You are on my list, but I have no room for you. You definitely have to stay here, so I''ll tell you what I''m going to do. I''ve got three folks here who weren''t quite as bad as you. I''ll let one of them go, but you have to take their place. I''ll even let YOU decide who leaves.\"\n Donald thought that sounded pretty good, so the devil opened the door to the first room.\n In it, was Richard Nixon and a  large pool of water. Nixon kept diving in, and surfacing, empty handed.\n  \n Over, and over, and over he dived in and surfaced with nothing. Such was his fate in  hell.\n \"No,\" Donald said. \"I don''t think so. I''m not a good swimmer and it would ruin my hair. I don''t think I could do that all day  long.”\n The devil led him to the door of the next room. In it, was Ronald Reagan with a sledge-hammer and a room full of rocks.\n  \n All he did was swing that  hammer, time after time after time. \"No, this is no good; I''ve got this problem with my shoulder.”\n  \n “I would be in constant agony if all I could do was break rocks all day”, commented Donald.\n The devil opened a third door.\n  \n Through it, Donald saw Bill Clinton, lying on the bed, his arms tied over his head, and his legs restrained in a spread-eagle pose.\n  \n Bent over him was Monica Lewinsky, doing what she does best.\n  \n Donald looked at this in shocked disbelief, and finally said, \"Yeah man, I can handle this.\"\n The devil smiled and said, “Okay: Monica, you''re free to go.\""
        ],
        0.07692307692307693,
        [
            2203,
            4089
        ]
    ],
    [
        [
            "Gay Couple on a Plane A gay couple (Jeremiah and Timothy) is traveling on a plane. \n \"What if we had sex?\" asks Jeremiah.\n \"Are you crazy? Here, on the plane? It would be awkward, everyone would watch us doing it...\"\n \"Nobody is even paying attention to anything. Look!\"\n Jeremiah stands up and asks loudly:\n \"Could I have a napkin, please?\"\n Nobody gives a damn. Everyone is sleeping, reading, looking out the window, etc.  Flight attendants pretend to not hear them, as they also don''t give a damn.\n \"They really wouldn''t care then, would they?\" says Timothy.\n So Jeremiah and Timothy have wild sex on the plane.\n Later, when the plane arrives to the airport and the people are leaving, the stewardess sees an old man who threw up all over his shirt, even his pants are soaking in the filth.\n \"Sir, you should''ve asked for a bag!\"\n \"I didn''t dare\" whispers the old man. \"A few rows ahead I saw a man asking for a napkin and he got fucked in the ass...\"",
            "Two gay men are travelling... ...on a plane. Let''s call them Steve and Bill.\n \"Dude, what if we had sex?\" asks Steve.\n \"You crazy? Here, on the plane? It would be awkward, everyone would watch us doing it...\"\n \"Man, nobody is even paying attention to anything. Look!\"\n Steve stands up and asks loudly:\n \"Could I have a pencil, please?\"\n Nobody gives a damn. Everyone is sleeping, reading, looking out the window, etc.\n \"They really wouldn''t care then, would they?\" says Bill.\n So Steve and Bill have wild sex on the plane.\n Later, when the plane arrives to the airport and the people are leaving, the stewardess sees an old man who threw up all over his shirt, even his pants are soaking in the filth.\n \"Sir, you should''ve asked for a bag!\"\n \"I didn''t dare\" whispers the old man. \"A few rows ahead I saw a man asking for a pencil and he got fucked in the ass...\""
        ],
        0.2653061224489796,
        [
            2208,
            2715
        ]
    ],
    [
        [
            "Girl: “Forgive me father for I have sinned.” Priest: “What have you done my child?”\n Girl: “I called a man a son of a bitch.”\n Priest: “Why did you call him a son of a bitch?”\n Girl: “Because he touched my hand.”\n Priest: “Like this?” (as he touches her hand)\n Girl: “Yes father.”\n Priest: “That’s no reason to call a man a son of a bitch.”\n Girl: “Then he touched my breast.”\n Priest: “Like this?” (as he touched her breast)\n Girl: “Yes father.”\n Priest: “That’s no reason to call him a son of a bitch.”\n Girl: “Then he took off my clothes, father.”\n Priest: “Like this?” (as he takes off her clothes)\n Girl: “Yes father.\n Priest: “That’s no reason to call him a son of a bitch.”\n Girl: “Then he stuck his you know what into my you know where.”\n Priest: “Like this?” (as he stuck his you know what into her you know where)\n Girl: “YES FATHER, YES FATHER, YES FATHER!!!”\n Priest: (after a few minutes): “That’s no reason to call him a son of a bitch.”\n Girl: “But father he had AIDS!”\n Priest: “THAT SON OF A BITCH!!!”",
            "NSFW.. Girl: \"Forgive me father for I have sinned.\" Priest: \"What have you done my child?\" Girl: \"I called a man a son of a bitch.\" \n  \n Priest: \"Why did you call him a son of a bitch?\" \n  \n Girl: \"Because he touched my hand.\" \n  \n Priest: \"Like this?\" (as he touches her hand) \n  \n Girl: \"Yes father.\" \n  \n Priest: \"That''s no reason to call a man a son of a bitch.\" \n  \n Girl: \"Then he touched my breast.\" \n  \n Priest: \"Like this?\" (as he touched her breast) \n  \n Girl: \"Yes father.\" \n  \n Priest: \"That''s no reason to call him a son of a bitch.\" \n  \n Girl: \"Then he took off my clothes, father.\" \n  \n Priest: \"Like this?\" (as he takes off her clothes) \n  \n Girl: \"Yes father.\" \n  \n Priest: \"That''s no reason to call him a son of a bitch.\" \n  \n Girl: \"Then he stuck his you know what into my you know where.\" \n  \n Priest: \"Like this?\" (as he stuck his you know what into her you know where) \n  \n Girl: \"YES FATHER, YES FATHER, YES FATHER!!!\" \n  \n Priest: (after a few minutes): \"That''s no reason to call him a son of a bitch.\" \n  \n Girl: \"But father he had AIDS!\" \n  \n Priest: \"THAT SON OF A BITCH!!!\""
        ],
        0.07407407407407407,
        [
            2239,
            2538
        ]
    ],
    [
        [
            "Girl: “Forgive me father for I have sinned.” Priest: “What have you done my child?”\n Girl: “I called a man a son of a bitch.”\n Priest: “Why did you call him a son of a bitch?”\n Girl: “Because he touched my hand.”\n Priest: “Like this?” (as he touches her hand)\n Girl: “Yes father.”\n Priest: “That’s no reason to call a man a son of a bitch.”\n Girl: “Then he touched my breast.”\n Priest: “Like this?” (as he touched her breast)\n Girl: “Yes father.”\n Priest: “That’s no reason to call him a son of a bitch.”\n Girl: “Then he took off my clothes, father.”\n Priest: “Like this?” (as he takes off her clothes)\n Girl: “Yes father.\n Priest: “That’s no reason to call him a son of a bitch.”\n Girl: “Then he stuck his you know what into my you know where.”\n Priest: “Like this?” (as he stuck his you know what into her you know where)\n Girl: “YES FATHER, YES FATHER, YES FATHER!!!”\n Priest: (after a few minutes): “That’s no reason to call him a son of a bitch.”\n Girl: “But father he had AIDS!”\n Priest: “THAT SON OF A BITCH!!!”",
            "A girl goes to a Church to confess..... Girl : \"Forgive me father for I have sinned.\"\n Priest : \"What have you done my child?\"\n Girl : \"I called a man a son of a bitch.\"\n Priest : \"Why did you call him a son of a bitch?\"\n Girl : \"Because he touched my hand.\"\n Priest : \"Like this?\" (as he touches her hand)\n Girl : \"Yes father.\"\n Priest : \"That''s no reason to call a man a son of a bitch.\"\n Girl : \"Then he touched my breast.\"\n Priest : \"Like this?\" (as he touched her breast)\n Girl : \"Yes father.\"\n Priest : \"That''s no reason to call him a son of a bitch.\"\n Girl : \"Then he took off my clothes, father.\"\n Priest : \"Like this?\" (as he takes off her clothes)\n Girl : \"Yes father.\"\n Priest : \"That''s no reason to call him a son of a bitch.\"\n Girl : \"Then he stuck his you know what into my you know where.\"\n Priest : \"Like this?\" (as he stuck his you know what into her you know where)\n Girl : \"YES FATHER, YES FATHER, YES FATHER!!!\"\n (after a few minutes)\n Priest : \"That''s no reason to call him a son of a bitch.\"\n Girl : \"But father, he had AIDS!\"\n Priest : \"THAT SON OF A BITCH!!!\""
        ],
        0.12790697674418605,
        [
            2239,
            4117
        ]
    ],
    [
        [
            "Once upon a time there lived a beautiful Queen with large breasts Nick the Dragon Slayer obsessed over the Queen for this reason. He knew that the penalty for his desire would be death should he try to touch them, but he had to try. \n One day Nick revealed his secret desire to his colleague,Horatio the Physician, the King''s chief doctor.Horatio thought about this, and said that he could arrange for Nick to more than satisfy his desire, but it would cost him 1000 gold coins to arrange it. \n Without pause Nick readily agreed to the scheme. \n The next day, Horatio made a batch of itching powder and poured a little bit into the Queen''s bra while she bathed. Soon after she dressed, the itching commenced and grew intense. \n Upon being summoned to the Royal Chambers to address this incident, Horatio informed the King and Queen that only a special saliva, if applied for four hours, would cure this type of itch, and that tests had shown that only the saliva of Nick would work as the antidote to cure the itch.\n The King, eager to help his Queen, quickly summoned Nick to their chambers. \n Horatio then slipped Nick the antidote for the itching powder, which he put into his mouth, and for the next four hours, Nick worked passionately on the Queen''s large and magnificent breasts. The Queen''s itching was eventually relieved, and Nick left satisfied and hailed as a hero.\n Upon returning to his chamber, Nick found Horatio demanding his payment of 1000 gold coins. With his obsession now satisfied, Nick couldn''t have cared less knowing that Horatio could never report this matter to the King and with a laugh told him to get lost.\n The next day, Horatio slipped a massive dose of the same itching powder into the King''s underwear. The King immediately summoned Nick.\n The moral of the story - Pay your bills !!",
            "Once upon a time there lived a ravishing Queen with huge tits.. Nick the Dragon Slayer obsessed over the Queen for this reason. He knew that the penalty for his desire would be death should he try to touch them, but he had to try. \n One day Nick revealed his secret desire to his colleague,Horatio the Physician, the King''s chief doctor.Horatio thought about this, and said that he could arrange for Nick to more than satisfy his desire, but it would cost him 1000 gold coins to arrange it. \n Without pause Nick readily agreed to the scheme. \n The next day, Horatio made a batch of itching powder and poured a little bit into the Queen''s bra while she bathed. Soon after she dressed, the itching commenced and grew intense. \n Upon being summoned to the Royal Chambers to address this incident, Horatio informed the King and Queen that only a special saliva, if applied for four hours, would cure this type of itch, and that tests had shown that only the saliva of Nick would work as the antidote to cure the itch.\n The King, eager to help his Queen, quickly summoned Nick to their chambers. \n Horatio then slipped Nick the antidote for the itching powder, which he put into his mouth, and for the next four hours, Nick worked passionately on the Queen''s large and magnificent breasts. The Queen''s itching was eventually relieved, and Nick left satisfied and hailed as a hero.\n Upon returning to his chamber, Nick found Horatio demanding his payment of 1000 gold coins. With his obsession now satisfied, Nick couldn''t have cared less knowing that Horatio could never report this matter to the King and with a laugh told him to get lost.\n The next day, Horatio slipped a massive dose of the same itching powder into the King''s underwear. The King immediately summoned Nick."
        ],
        0.07865168539325842,
        [
            2254,
            3463
        ]
    ],
    [
        [
            "My girlfriend always takes long baths after we finish watching a Ryan gosling movie I don''t know what she''s doing in there, but it gives me lots of time to jerk off to Ryan Gosling ",
            "My girlfriend always takes long showers after watching movies starring Chris Pratt I don''t know what she''s doing in there, but it gives me lots of time to jerk off to Chris Pratt."
        ],
        0.32558139534883723,
        [
            2256,
            2368
        ]
    ],
    [
        [
            "The nurse at the sperm bank asked me if I''d like to masturbate in the cup... I said, \"Well, I''m pretty good, but I don''t think I''m ready to compete just yet.\"",
            "The nurse at the sperm bank asked me if I''d like to masturbate in the cup... I said, \"Well, I''m pretty good, but I don''t think I''m ready to compete just yet.\"\n ---"
        ],
        0.13513513513513514,
        [
            2262,
            2280
        ]
    ],
    [
        [
            "Do you know how to avoid clickbait? Obviously not",
            "Do you know how to avoid clickbait? Apparently not.\n -"
        ],
        0.38461538461538464,
        [
            2305,
            2421
        ]
    ],
    [
        [
            "A professor, a CEO, and a janitor are in a forest when they discover a magic fairy. The fairy says “I will give you what you most desire if you do someone else’s job for a day.”\n The professor says “I’ll be an elementary school teacher. What can be so hard about teaching a bunch of 6-year-olds how to read?” so he is teleported into a classroom. After a few minutes, all the kids’ screaming gets to his nerves, so he throws all his supplies and gives up.\n The C.E.O says “I’ll be a waiter. All you do is carry food back and forth. This’ll be a breeze” so he is teleported to a restaurant. After about an hour, all the annoying customers drive him insane, so he smashes his plates on the ground and gives up.\n The janitor says “I’ll be an artist” so he is transported to an art facility. He glues all the classroom supplies and shattered plates to a canvas, then sells it for a billion dollars. The fairy asks the janitor how he was so clever.\n The janitor says “I got a masters degree in art.”",
            "A professor, a CEO, and a janitor are in a forest when they discover a magic fairy.  The fairy says \"I will give you what you most desire if you do someone else''s job for a day.\"\n The professor says \"I''ll be an elementary school teacher. What can be so hard about teaching a bunch of 6-year-olds how to read?\" so he is teleported into a classroom. After a few minutes, all the kids'' screaming gets to his nerves, so he throws all his supplies and gives up.\n The C.E.O says \"I''ll be a waiter. All you do is carry food back and forth. This''ll be a breeze\" so he is teleported to a restaurant. After about an hour, all the annoying customers drive him insane, so he smashes his plates on the ground and gives up.\n The janitor says \"I''ll be an artist\" so he is transported to an art facility. He glues all the classroom supplies and shattered plates to a canvas, then sells it for a billion dollars. The fairy asks the janitor how he was so clever.\n The janitor says \"I got a masters degree in art.\""
        ],
        0.042735042735042736,
        [
            2350,
            2401
        ]
    ],
    [
        [
            "My wife left me because I am insecure No wait, she''s back.\n She just went to get coffee.",
            "My wife left me because I am insecure No wait, she''s back. She just went to get coffee"
        ],
        0.045454545454545456,
        [
            2372,
            2387
        ]
    ],
    [
        [
            "My girlfriend tried to make me have sex on the hood of her Honda Civic I refused.  If I''m going to have sex, its going to be on my own Accord",
            "My girlfriend tried to make me have sex on the hood of her Honda Civic… But I refused. If I’m going to have sex, it’s going to be on my own Accord."
        ],
        0.2727272727272727,
        [
            2388,
            4050
        ]
    ],
    [
        [
            "Only anti-vaxxers will get this Measles",
            "Only anti-vaxxers will get this... Measles"
        ],
        0.14285714285714285,
        [
            2398,
            2508
        ]
    ],
    [
        [
            "A guy goes to Las Vegas to gamble And he loses all his money. He doesn''t even have enough for a cab, but he flagged one down anyway. He explained to the driver that he would pay him back next time and gave him his phone number, but the driver told him, \"Get the fuck out of my cab.\" So he walked all the way to the airport and got home. Some times rolls by and he decides to go back to Vegas again and this time he wins BIG. \n He gets his bags and is ready for the airport with all his new winnings. There are a line of cabs and at the very end he sees the driver from last time that kicked him out. He stood for a moment thinking how can he get his revenge on that driver. \n So, he gets in the first cab. \n \"How much is it to the airport?\" He asks. \n The driver says, \"$15\" \n \"Great, how much is it for a blowjob on the way there?\" \n The cab driver says, \"Get the fuck out of my cab.\" \n So he goes to the next one and asks the same thing. \"How much to airport?\" \n \"$15\" \n \"Great, how much for a blowjob on the way there?\" \n And that cab driver also tells him to get the fuck out of his cab. \n He does this all the way down the line of drivers, each one kicking him out. He finally gets to the last driver, the one from his last trip. \n He asks, \"hey how much to the airport?\" \n Driver responds, \"$15\" \n The guy hands him $15 and says \"great let''s go\" \n And so the driver leaves, slowly passing all the other drivers who are staring out their window while the guy in the back smiles back with a thumbs up.",
            "A guy goes to Las Vegas to gamble and he loses all his money. He doesn''t even have enough for a cab, but he flagged one down anyway. He explained to the driver that he would pay him back next time and gave him his phone number, but the driver told him, \"Get the fuck out of my cab.\" He walked all the way to the airport and got home. \n Some times rolls by and he decides to go back to Vegas again and this time he wins BIG.\n  He gets his bags and is ready for the airport with all his new winnings.\n  There are a line of cabs and at the very end he sees the driver from last time that kicked him out. \n He stood for a moment thinking how can he get his revenge on that driver.\n  So, he gets in the first cab. \n \"How much is it to the airport?\" he asks. \n The driver says, \"$15.\" \n \"Great, how much is it for a blowjob on the way there?\" \n The cab driver says, \"Get the fuck out of my cab.\" \n So he goes to the next one and asks the same thing.\n  \"How much to airport?\" \n \"$15.\" \n \"Great, how much for a blowjob on the way there?\" \n And that cab driver also tells him to get the fuck out of his cab.\n  He does this all the way down the line of drivers, each one kicking him out.\n  He finally gets to the last driver, the one from his last trip.\n  He asks, \"Hey how much to the airport?\"\n  Driver responds, \"$15.\" \n The guy hands him $15 and says, \"Great let''s go!\" \n And so the driver leaves, slowly passing all the other drivers who are staring out their window while the guy in the back smiles back with a thumbs up."
        ],
        0.034722222222222224,
        [
            2413,
            4021
        ]
    ],
    [
        [
            "The best years of my life were spent in the arms of another man''s wife... Thank you, Mom. Happy Mother''s Day!",
            "The best years of my life were spent in the arms of another man''s wife... Thank you for everything, Mom.\n Happy Mothers'' Day! "
        ],
        0.14285714285714285,
        [
            2441,
            2596
        ]
    ],
    [
        [
            "The best years of my life were spent in the arms of another man''s wife... Thank you, Mom. Happy Mother''s Day!",
            "The best years of my life were spent in the arms of another man''s wife... Happy Mother''s Day!"
        ],
        0.16,
        [
            2441,
            4198
        ]
    ],
    [
        [
            "“I can’t believe that you’ve been visiting prostitutes for sex,” my wife screamed at me. “I’m really disappointed.” “You can hardly blame me,” I answered. “It’s not like I was getting any from you.”\n “Well, that’s your own fault,” she replied. “You never told me you were willing to pay for it.”",
            "I can’t believe that you’ve been visiting prostitutes for sex,” my wife screamed at me. “I can’t believe that you’ve been visiting prostitutes for sex,” my wife screamed at me. “I’m really disappointed.” “You can hardly blame me,” I answered. “It’s not like I was getting any from you.” “Well, that’s your own fault,” she replied. “You never told me you were willing to pay for it.”"
        ],
        0.0,
        [
            2442,
            3290
        ]
    ],
    [
        [
            "(NSFW) A priest has a heart attack, and is rushed to the hospital. He wakes up as he''s being rushed through the hospital on a gurney by two nurses. \"Am I in heaven?\" asks the disoriented priest.  \"No\" says one of the nurses. \"We''re just taking a short cut through the children''s ward\".",
            "A priest has a heart attack, and is rushed to the hospital. He wakes up as he''s being rushed through the hospital on a gurney by two nurses. \"Am I in heaven?\" asks the disoriented priest. \"No\" says one of the nurses. \"We''re just taking a short cut through the children''s ward\"."
        ],
        0.05660377358490566,
        [
            2457,
            2532
        ]
    ],
    [
        [
            "(NSFW) A priest has a heart attack, and is rushed to the hospital. He wakes up as he''s being rushed through the hospital on a gurney by two nurses. \"Am I in heaven?\" asks the disoriented priest.  \"No\" says one of the nurses. \"We''re just taking a short cut through the children''s ward\".",
            "A priest has a heart attack, and is rushed to the hospital. He wakes up as he’s being rushed through the hospital on a gurney by two nurses.\n “Am I in heaven?” asks the disoriented priest.\n “No” says one of the nurses. “We’re just taking a short cut through the children’s ward.”"
        ],
        0.14285714285714285,
        [
            2457,
            3755
        ]
    ],
    [
        [
            "A woman is having an affair during the day while her husband is at work A woman is having an affair during the day while her husband is at work. Her 9 year old son comes home unexpectedly, sees them and hides in the bedroom closet to watch. The woman’s husband also comes home. She puts her lover in the closet, not realizing that the little boy is in there already.\n The little boy says, “Its dark in here.”\n The man says, “Yes, it is.”\n Boy ~ “I have a baseball.”\n Man ~ “That’s nice.”\n Boy ~ “Want to buy it?”\n Man ~ “No, thanks.”\n Boy ~ “My dad’s outside.”\n Man ~ “OK, how much?”\n Boy ~ “$250?\n In the next few weeks, it happens again that the boy and the lover are in the closet together.\n Boy ~ “Its dark in here.”\n Man ~ “Yes, it is.”\n Boy ~ “I have a baseball glove.”\n The lover remembering the last time, asks the boy, “How much?”\n Boy ~ “$750?\n Man ~ “Fine.”\n A few days later, the father says to the boy, “Grab your glove, let’s go outside and have a game of catch.”\n The boy says, “I can’t, I sold my baseball and my glove.”\n The father asks, “How much did you sell them for?”\n Boy ~ “$1,000?\n The father says, “That’s terrible to overcharge your friends like that…that is way more than those two things cost. I’m going to take you to church and make you confess.”\n They go to the church and the father makes the little boy sit in the confession booth and he closes the door.\n The boy says, “Dark in here.”\n The priest says, “Don’t start that crap again.”",
            "A woman takes a lover home during the day while her husband is at work... Her 9-year old son comes home unexpectedly, sees them and hides in the bedroom closet to watch.\n The woman''s husband also comes home. She puts her lover in the closet, not realizing that the little boy is in there already.\n The little boy says, \"Dark in here.\"\n The man says, \"Yes, it is.\"\n Boy - \"I have a baseball.\"\n Man - \"That''s nice.\"\n Boy - \"Want to buy it?\"\n Man - \"No, thanks.\"\n Boy - \"My dad''s outside.\"\n Man - \"OK, how much?\"\n Boy - \"$150\" \n Man - \"Sold.\"\n In the next few weeks, it happens again that the boy and the lover are in the closet together.\n Boy - \"Dark in here.\"\n Man - \"Yes, it is.\"\n Boy - \"I have a Wilson infielder''s glove.\"\n The lover, remembering the last time, asks the boy,\"How much?\"\n Boy - \"$350\"\n Man - \"Highway robbery. Sold.\"\n A few days later, the father says to the boy, \"Grab your gloves, let''s go outside and have a game of catch.\"\n The boy says, \"I can''t, I sold my ball and my glove.\"\n The father asks, \"How much did you sell them for?\"\n The boy says, \"$500\" The father says, \"That''s terrible to overcharge your friends like that... that is way more than those two things cost. I''m going to take you to church and make you confess your greed.\"\n They go to the church and the father makes the little boy sit in the confession booth with the Priest to confess his sins and he closes the door.\n The boy says, \"Dark in here.\"\n The priest says, \"Don''t start that crap again, you''re in my closet now.\""
        ],
        0.25287356321839083,
        [
            2465,
            3578
        ]
    ],
    [
        [
            "My local drug dealer started dressing up as a Jehovah''s Witness so he wouldn''t arouse suspicion. He got arrested after the police saw people actually letting him in.",
            "My local drug dealer started dressing up as a Jehovah’s Witness so he wouldn’t arouse suspicion. \n He got arrested after the police saw people actually letting him in."
        ],
        0.06060606060606061,
        [
            2467,
            4219
        ]
    ],
    [
        [
            "My girlfriend yelled at me today saying, \"You weren''t even listening just now, were you?!\" I thought, \"Man, what a weird way to start a conversation.\"",
            "My girlfriend yelled at me today saying, \"You weren''t even listening just now, were you?!\" I thought, \"Man, what a weird way to start a conversation.\"\n "
        ],
        0.0,
        [
            2468,
            4275
        ]
    ],
    [
        [
            "Three brothers age 92, 94 and 96 live in a house together. One night the 96 year old draws a bath, puts his foot in and pauses.\n He yells down the stairs, \"Was I getting in or out of the bath?\"\n The 94 year old yells back, \"I don''t know, I''ll come up and see.\"\n He starts up the stairs and pauses, then he yells,\n \"Was I going up the stairs or coming down?\"\n The 92 year old was sitting at the kitchen table having coffee\n listening to his brothers. He shakes his head and says, \n \"I sure hope I never get that forgetful.\" He knocks \n on wood for good luck. He then yells, \n \"I''ll come up and help both of you as soon as I see \n who''s at the door.\"",
            "Best knock knock joke ever.. Three brothers age 92, 94 and 96 live in a house together.\n One night the 96 year old draws a bath, puts his foot in and pauses. He yells down the stairs, \"Was I getting in or out of the bath?\"\n The 94 year old yells back, \"I don''t know, I''ll come up and see.\" He starts up the stairs and pauses, then he yells, \"Was I going up the stairs or coming down?\"\n The 92 year old was sitting at the kitchen table having coffee listening to his brothers. He shakes his head and says, \"I sure hope I never get that forgetful.\" He knocks on wood for good luck. He then yells, \"I''ll come up and help both of you as soon as I see who''s at the door.\""
        ],
        0.04395604395604396,
        [
            2501,
            3576
        ]
    ],
    [
        [
            "Genie: You have 3 wishes. Genie: You have 3 wishes.\n Me: I''ve seen this before. Whatever I wish for will come back and bite me in some way.\n Genie: I promise that won''t happen. I''m so sure it won''t I''ll give you infinite wishes if it does.\n Me: Okay. I wish for a boomerang with teeth.\n Genie: You son of a ........",
            "Genie: I will grant you 3 wishes. Me: I''ve seen this before. Whatever I wish for will come back and bite me in some way.\n Genie: I promise that won''t happen. I''m so sure it won''t I''ll give you infinite wishes if it does.\n Me: Okay. I wish for a boomerang with teeth.\n Genie: You son of a ........"
        ],
        0.0392156862745098,
        [
            2515,
            4661
        ]
    ],
    [
        [
            "A priest has a heart attack, and is rushed to the hospital. He wakes up as he''s being rushed through the hospital on a gurney by two nurses. \"Am I in heaven?\" asks the disoriented priest. \"No\" says one of the nurses. \"We''re just taking a short cut through the children''s ward\".",
            "A priest has a heart attack, and is rushed to the hospital. He wakes up as he’s being rushed through the hospital on a gurney by two nurses.\n “Am I in heaven?” asks the disoriented priest.\n “No” says one of the nurses. “We’re just taking a short cut through the children’s ward.”"
        ],
        0.09433962264150944,
        [
            2532,
            3755
        ]
    ],
    [
        [
            "I scared the postman today by going to the door completely naked. I''m not sure what scared him more. My naked body or the fact I knew where he lived",
            "I scared the postman today by going to the door completely naked… I’m not sure what freaked him out more – my naked body or the fact that I knew where he lived."
        ],
        0.3611111111111111,
        [
            2534,
            3568
        ]
    ],
    [
        [
            "NSFW.. Girl: \"Forgive me father for I have sinned.\" Priest: \"What have you done my child?\" Girl: \"I called a man a son of a bitch.\" \n  \n Priest: \"Why did you call him a son of a bitch?\" \n  \n Girl: \"Because he touched my hand.\" \n  \n Priest: \"Like this?\" (as he touches her hand) \n  \n Girl: \"Yes father.\" \n  \n Priest: \"That''s no reason to call a man a son of a bitch.\" \n  \n Girl: \"Then he touched my breast.\" \n  \n Priest: \"Like this?\" (as he touched her breast) \n  \n Girl: \"Yes father.\" \n  \n Priest: \"That''s no reason to call him a son of a bitch.\" \n  \n Girl: \"Then he took off my clothes, father.\" \n  \n Priest: \"Like this?\" (as he takes off her clothes) \n  \n Girl: \"Yes father.\" \n  \n Priest: \"That''s no reason to call him a son of a bitch.\" \n  \n Girl: \"Then he stuck his you know what into my you know where.\" \n  \n Priest: \"Like this?\" (as he stuck his you know what into her you know where) \n  \n Girl: \"YES FATHER, YES FATHER, YES FATHER!!!\" \n  \n Priest: (after a few minutes): \"That''s no reason to call him a son of a bitch.\" \n  \n Girl: \"But father he had AIDS!\" \n  \n Priest: \"THAT SON OF A BITCH!!!\"",
            "A girl goes to a Church to confess..... Girl : \"Forgive me father for I have sinned.\"\n Priest : \"What have you done my child?\"\n Girl : \"I called a man a son of a bitch.\"\n Priest : \"Why did you call him a son of a bitch?\"\n Girl : \"Because he touched my hand.\"\n Priest : \"Like this?\" (as he touches her hand)\n Girl : \"Yes father.\"\n Priest : \"That''s no reason to call a man a son of a bitch.\"\n Girl : \"Then he touched my breast.\"\n Priest : \"Like this?\" (as he touched her breast)\n Girl : \"Yes father.\"\n Priest : \"That''s no reason to call him a son of a bitch.\"\n Girl : \"Then he took off my clothes, father.\"\n Priest : \"Like this?\" (as he takes off her clothes)\n Girl : \"Yes father.\"\n Priest : \"That''s no reason to call him a son of a bitch.\"\n Girl : \"Then he stuck his you know what into my you know where.\"\n Priest : \"Like this?\" (as he stuck his you know what into her you know where)\n Girl : \"YES FATHER, YES FATHER, YES FATHER!!!\"\n (after a few minutes)\n Priest : \"That''s no reason to call him a son of a bitch.\"\n Girl : \"But father, he had AIDS!\"\n Priest : \"THAT SON OF A BITCH!!!\""
        ],
        0.08333333333333333,
        [
            2538,
            4117
        ]
    ],
    [
        [
            "A cowboy walks into a bar and takes a seat next to a very attractive woman… He gives her a quick glance then causally looks at his watch for a moment.\n The woman notices this and asks, \"Is your date running late?\"\n \"No\", he replies, \"I just got this state-of the-art watch, and I was just testing it.\"\n The intrigued woman says, \"A state-of-the-art watch? What''s so special about it?\"\n The cowboy explains, \"It uses alpha waves to talk to me telepathically.\"\n The lady says, \"What''s it telling you now?\"\n \"Well, it says you''re not wearing any panties.\"\n The woman giggles and replies, \"Well it must be broken because I am wearing panties!\"\n The cowboy smiles, taps his watch and says, \"Damn thing''s an hour fast.\"",
            "James Bond walks into a bar and takes a seat next to a very attractive woman. He gives her a quick glance, and then casually looks at his watch for a moment. The woman notices this and asks, \"Is your date running late?\" \"No,\" he replies, \"Q has just given me this state-of-the-art watch. I was just testing it.\" The intrigued woman says, \"A state-of-the-art watch? What''s so special about it?\" Bond explains, \"It uses alpha waves to talk to me telepathically.\" The lady says, \"What''s it telling you now?\" \"Well, it says you''re not wearing any panties.\" The woman giggles and replies, \"Well it must be broken because I''m wearing panties!\" Bond smirks, taps his watch and says, \"Bloody thing''s an hour fast.\""
        ],
        0.18867924528301888,
        [
            2557,
            5412
        ]
    ],
    [
        [
            "I was passing by my son''s bedroom and was astonished to see the bed was nicely made and everything was picked up. Then, I saw an envelope, propped up prominently on the pillow. It was addressed, ''Dad''. With the worst premonition, I opened the envelope and read the letter, with trembling hands... Dear Dad.\n It is with great regret and sorrow that I''m writing you.\n I had to elope with my new girlfriend, because I wanted to avoid a scene with mom and you.\n I''ve been finding real passion with Stacy.\n She is so nice, but I knew you would not approve of her because of all her piercing''s, tattoos, her tight motorcycle clothes and because she is so much older than I am.\n But it''s not only the passion, dad.\n She''s pregnant.\n Stacy said that we will be very happy.\n She owns a trailer in the woods, and has a stack of firewood for the whole winter.\n We share a dream of having many more children.\n Stacy has opened my eyes to the fact that marijuana doesn''t really hurt anyone.\n We''ll be growing it for ourselves and trading it with the other people in the commune for all the cocaine and ecstasy we want.\n In the meantime, we''ll pray that science will find a cure for AIDS so that Stacy can get better.\n She sure deserves it!\n Don''t worry dad, I''m 15, and I know how to take care of myself.\n Someday, I''m sure we''ll be back to visit so you can get to know your many grandchildren.\n Love, your son, Joshua.\n P.S. Dad, none of the above is true.\n I''m over at Jason''s house.\n I just wanted to remind you that there are worse things in life than the school report that''s on the kitchen table.\n Call when it is safe for me to come home!",
            "I was passing by my son''s bedroom and was astonished to see the bed was nicely made and everything was picked up. Then, I saw an envelope, propped up prominently on the pillow, addressed to, ''Dad''. With the worst premonition, I opened the envelope and read the letter, with trembling hands... \n \"Dear, Dad.\n It is with great regret and sorrow that I''m writing you.\n I had to elope with my new girlfriend, because I wanted to avoid a scene with Mom and you.\n I''ve been finding real passion with Stacy.\n She is so nice, but I knew you would not approve of her because of all her piercing''s, tattoos, her tight motorcycle clothes and because she is so much older than I am.\n But it''s not only the passion, Dad.\n She''s pregnant.\n Stacy said that we will be very happy.\n She owns a trailer in the woods, and has a stack of firewood for the whole winter.\n We share a dream of having many more children.\n Stacy has opened my eyes to the fact that marijuana doesn''t really hurt anyone.\n We''ll be growing it for ourselves and trading it with the other people in the commune for all the cocaine and ecstasy we want.\n In the meantime, we''ll pray that science will find a cure for AIDS so that Stacy can get better.\n She sure deserves it!\n Don''t worry Dad, I''m 15, and I know how to take care of myself.\n Someday, I''m sure we''ll be back to visit so you can get to know your many grandchildren.\n Love, your son, Joshua.\n P.S. Dad, none of the above is true.\n I''m over at Jason''s house.\n I just wanted to remind you that there are worse things in life than the school report that''s on the kitchen table.\n Call when it is safe for me to come home!\""
        ],
        0.030612244897959183,
        [
            2560,
            3988
        ]
    ],
    [
        [
            "A lumberjack went in to a magic forest to cut a tree When he got there, he started to swing at a tree when it suddenly shouted, “Wait! I’m a talking tree!”\n The lumberjack laughed and said, “And you will dialogue.”",
            "A lumberjack went in to a magic forest to cut a tree. Upon arrival, he started to swing at the tree, when it shouted, “Wait! I’m a talking tree!\" \n The lumberjack grinned, “And you will dialogue!\""
        ],
        0.3333333333333333,
        [
            2571,
            4685
        ]
    ],
    [
        [
            "The best years of my life were spent in the arms of another man''s wife... Thank you for everything, Mom.\n Happy Mothers'' Day! ",
            "The best years of my life were spent in the arms of another man''s wife... Happy Mother''s Day!"
        ],
        0.2857142857142857,
        [
            2596,
            4198
        ]
    ],
    [
        [
            "I was having a conversation with a scammer the other day. Me: “Hello.”\n NOT-Microsoft support: “Hello. This is Bob Bobson from Microsoft Support. We are seeing a lot of virus activity from your device.”\n Me: “Oh no. My device? Are you sure?”\n NOT-Microsoft support: “Oh yes, we have many reports.”\n Me: “Oh jeez. How can I fix it?”\n NOT-Microsoft support: “It’s OK sir. We can help you right now. Are you in front of your device sir?”\n Me: “Yes. I was just about to use it. I’m glad you called.”\n NOT-Microsoft support: “Yes sir, we are going to help you. Can you please push the Start button?”\n Me: “I think it''s already on.”\n NOT-Microsoft support: “Okay, sir. Now you want to click on Control Panel.”\n Me: “I don’t see that.”\n NOT-Microsoft support: “Do you see a bunch of information above the Start button?”\n Me: “Yes.”\n NOT-Microsoft support: “That is your Control Panel.”\n Me: “Wow, I didn’t realize it had a name.”\n NOT-Microsoft support: “Yes sir, now press on Internet Options.”\n Me: “Yeah, I definitely don’t see any Internet options. I don’t think I purchased that feature. This is just a cheap one.”\n NOT-Microsoft support: “They all have the Internet sir. Press the Start button again.”\n Me: “OK, it’s the same as before.”\n NOT-Microsoft support: “That’s OK sir. We are going to restart your device. Can you please turn it off?”\n Me: “Ummm…I don’t know how. I’ve never turned it off. Since I bought it it just kind of stays on all the time.”\n NOT-Microsoft support: “There must be an off button on your device. How do you stop it when it’s running?”\n Me: “In those cases I usually press the big button beneath Stop/Cancel.”\n NOT-Microsoft support: “OK sir. Please press that button.”\n Me: “Ok.”\n NOT-Microsoft support: “Is your device off?”\n Me: “No. The door popped open.”\n NOT-Microsoft support: “Door? Is there a disc inside the door?”\n Me: “No, there’s a burrito.”\n NOT-Microsoft support: “Why is there a burrito in your computer?”\n Me: “Computer? I thought you said this was microwave support.”",
            "I was talking to a scammer the other day.  Me: “Hello.”\n NOT-Microsoft support: “Hello. This is Bob Bobson from Microsoft Support. We are seeing a lot of virus activity from your device.”\n Me: “Oh no. My device? Are you sure?”\n NOT-Microsoft support: “Oh yes, we have many reports.”\n Me: “Oh jeez. How can I fix it?”\n NOT-Microsoft support: “It’s OK sir. We can help you right now. Are you in front of your device sir?”\n Me: “Yes. I was just about to use it. I’m glad you called.”\n NOT-Microsoft support: “Yes sir, we are going to help you. Can you please push the Start button?”\n Me: “I think it''s already on.”\n NOT-Microsoft support: “Okay, sir. Now you want to click on Control Panel.”\n Me: “I don’t see that.”\n NOT-Microsoft support: “Do you see a bunch of information above the Start button?”\n Me: “Yes.”\n NOT-Microsoft support: “That is your Control Panel.”\n Me: “Wow, I didn’t realize it had a name.”\n NOT-Microsoft support: “Yes sir, now press on Internet Options.”\n Me: “Yeah, I definitely don’t see any Internet options. I don’t think I purchased that feature. This is just a cheap one.”\n NOT-Microsoft support: “They all have the Internet sir. Press the Start button again.”\n Me: “OK, it’s the same as before.”\n NOT-Microsoft support: “That’s OK sir. We are going to restart your device. Can you please turn it off?”\n Me: “Ummm…I don’t know how. I’ve never turned it off. Since I bought it, it just kind of stays on all the time.”\n NOT-Microsoft support: “There must be an off button on your device. How do you stop it when it’s running?”\n Me: “In those cases, I usually press the big button.”\n NOT-Microsoft support: “OK sir. Please press that button.”\n Me: “Ok.”\n NOT-Microsoft support: “Is your device off?”\n Me: “No. The door popped open.”\n NOT-Microsoft support: “Door? Is there a disc inside the door?”\n Me: “No, there’s a burrito.”\n NOT-Microsoft support: “Why is there a burrito in your computer?”\n Me: “Computer? I thought you said this was microwave support.”"
        ],
        0.03333333333333333,
        [
            2623,
            4129
        ]
    ],
    [
        [
            "Damn girl are you a newspaper? Because there''s a new issue with you every fucking day",
            "Hey girl are you a newspaper? Because there''s a new issue with you every fucking day"
        ],
        0.1111111111111111,
        [
            2645,
            3015
        ]
    ],
    [
        [
            "I was blessed with a 9 inch penis. That priest is in prison now.",
            "I was blessed with a 9 inch penis That priest is in prison now"
        ],
        0.1875,
        [
            2758,
            4383
        ]
    ],
    [
        [
            "A husband and wife are waiting at the bus stop with their 9 children. A blind man joins them after a few minutes. When the bus arrives, they find it overloaded and only the wife and the nine kids are able to fit onto the bus.\n So the husband and the blind man decide to walk. After a while, the husband gets irritated by the ticking of the stick of the blind man as he taps it on the sidewalk, and says to him, \"You know if you put a piece of rubber on the end of your stick I wouldn''t have to listen to that tapping.\" The blind man replies, \"If you would''ve put a rubber at the end of YOUR stick, we''d be riding the fucking bus.",
            "A husband and wife are waiting at the bus stop, with them are their 8 children. A blind man joins them after a few minutes.  When the bus arrives, they find it overloaded and only the wife and her eight children are able to fit in the bus. So the husband and the blind man decide to walk. After a while the husband gets irritated by the ticking of the stick of the blind man and says to him.  \"Why don''t you put a piece of rubber at the end of your stick, that ticking sound is driving me crazy!!\"  The blind man replies: \"If you would''ve put a rubber on the end of YOUR stick, we''d be sitting in the bus."
        ],
        0.3465346534653465,
        [
            2762,
            5465
        ]
    ],
    [
        [
            "How many introverts does it take to change a lightbulb? Why does it have to be a group activity?",
            "How many introverts does it take to change a light bulb? Why must it be a group activity?"
        ],
        0.2631578947368421,
        [
            2792,
            4122
        ]
    ],
    [
        [
            "Forget everything you learned in college... ''Forget everything you learned in college. You won''t need it working here.''\n ''But I never went to college.''\n ''Well then, I''m sorry. You are underqualified to work here.''",
            "\"Forget everything you learned in college... \"Forget everything you learned in college. You won''t need it working here.\"\n \"But I never went to college.\"\n \"Well then, I''m sorry. You are underqualified to work here.\"\n "
        ],
        0.0,
        [
            3276,
            3780
        ]
    ],
    [
        [
            "A woman joins a country club and when she hears the guys talking about their golf round, she says, \"I played on my college''s golf team. I was pretty good. Mind if I join you next week?\" No one wants to say ''yes'', but they''re on the spot… Finally, one man says, \"Okay, but we start at 6:30 a.m.\"\n He figures the early tee-time will discourage her.\n The woman says this may be a problem and asks if she can be up to 15 minutes late.\n They roll their eyes, but say, \"Okay.\"\n She''s there at 6:30 am. sharp and beats all of them with an eye-opening 2-under par round.\n She''s fun and pleasant and the guys are impressed.\n They congratulate her and invite her back the next week.\n She smiles, and says, \"I''ll be there at 6:30, or 6:45.\"\n The next week she again shows up at 6:30 sharp.\n Only this time, she plays left-handed.\n The three guys are incredulous as she still beats them with an even par round, despite playing with her off-hand.\n They''re totally amazed.\n They can''t figure her out.\n She''s very pleasant and a gracious winner.\n They invite her back again, but each man harbors a burning desire to beat her.\n The third week, she''s 15 minutes late, which irritates the guys.\n This week she plays right-handed and narrowly beats all three of them.\n The men grumble that her late arrival is petty gamesmanship on her part.\n However, she''s so charming and complimentary of their strong play, they can''t hold a grudge.\n This woman is a riddle no one can figure out.\n They have a couple of beers in the Clubhouse and finally, one of the men asks her, \"How do you decide if you''re going to golf right-handed or left-handed?\"\n The lady blushes, and grins. \"When my dad taught me to play golf, I learned that I was ambidextrous.\" she replies. \"I like to switch back and forth.\"\n \"When I got married after college, I discovered my husband always sleeps in the nude. From then on, I developed a silly habit. Right before I leave in the morning for golf practice, I pull the covers off him. If his willie points to the right, I golf right-handed; if it points to the left, I golf left-handed.\"\n The guys think this is hysterical.\n Astonished at this bizarre information, one of the guys says, \"What if it''s pointing straight up?\"\n She says, \"Then, I''m fifteen minutes late.\"",
            "A woman joins a country club and when she hears the guys talking about their golf round, she says, \"I played on my college''s golf team. I was pretty good. Mind if I join you next week?\" No one wants to say ''yes'', but they''re on the spot. \n Finally, one man says, \"Okay, but we start at 6:30 a.m.\"\n He figures the early tee-time will discourage her.\n The woman says this may be a problem and asks if she can be up to 15 minutes late.\n They roll their eyes, but say, \"Okay.\"\n She''s there at 6:30 am. sharp and beats all of them with an eye-opening 2-under par round.\n She''s fun and pleasant and the guys are impressed.\n They congratulate her and invite her back the next week.\n She smiles, and says, \"I''ll be there at 6:30, or 6:45.\"\n The next week she again shows up at 6:30 sharp.\n Only this time, she plays left-handed.\n The three guys are incredulous as she still beats them with an even par round, despite playing with her off-hand.\n They''re totally amazed.\n They can''t figure her out.\n She''s very pleasant and a gracious winner.\n They invite her back again, but each man harbors a burning desire to beat her.\n The third week, she''s 15 minutes late, which irritates the guys.\n This week she plays right-handed and narrowly beats all three of them.\n The men grumble that her late arrival is petty gamesmanship on her part.\n However, she''s so charming and complimentary of their strong play, they can''t hold a grudge.\n This woman is a riddle no one can figure out.\n They have a couple of beers in the Clubhouse and finally, one of the men asks her, \"How do you decide if you''re going to golf right-handed or left-handed?\"\n The lady blushes, and grins. \"When my dad taught me to play golf, I learned that I was ambidextrous.\" she replies. \"I like to switch back and forth.\"\n \"When I got married after college, I discovered my husband always sleeps in the nude. From then on, I developed a silly habit. Right before I leave in the morning for golf practice, I pull the covers off him. If his willie points to the right, I golf right-handed; if it points to the left, I golf left-handed.\"\n The guys think this is hysterical.\n Astonished at this bizarre information, one of the guys says, \"What if it''s pointing straight up?\"\n She says, \"Then, I''m fifteen minutes late.\""
        ],
        0.008771929824561403,
        [
            3490,
            4110
        ]
    ],
    [
        [
            "“Father, do you have anything to declare?” A beautiful young woman, on an international flight, asked the priest beside her, “Father, may I ask a favor?”\n “Of course you may. What can I do for you?”\n “Well, I bought this expensive electronic hair dryer that is well over the Customs limits and I’m afraid  that they’ll confiscate it from me. Is there anyway that you could carry it through Customs for me? Under your robes perhaps?”\n “I would love to help you, dear, but I must warn you: I will not lie.”\n “With your honest face, Father, no one will question you.”\n When they got to Customs, the young lady let the priest go ahead of her. The Customs Officer asked, “Father, do you have anything to declare?”\n “From the top of my head down to my waist, I have nothing to declare.”\n The Officer thought this answer strange, so he asked, “And what do you have to declare from your waist to the floor?”\n “I have a marvelous little instrument designed to be used on a woman, but which is, to date, unused.”\n Roaring with laughter, the Officer said, “God bless you, Father, go ahead.”",
            "A distinguished young woman on a flight from Ireland asked the Priest beside her, ''Father, may I ask a favour?'' ''Of course child. What may I do for you?'' \n ‘Well, I bought an expensive woman''s electronic hair dryer for my Mother''s birthday that is unopened and well over the Customs limits, and I''m afraid they''ll confiscate it. Is there any way you could carry it through customs for me? Under your robes perhaps?''\n ''I would love to help you, dear, but I must warn you: I will not lie.''\n ''With your honest face, Father, no one will question you.''\n When they got to Customs, she let the priest go ahead of her. The official asked, ''Father, do you have anything to declare?''\n ''From the top of my head down to my waist, I have nothing to declare.''\n The official thought this answer strange, so asked, ''And what do you have to declare from your waist to the floor?''\n ''I have a marvelous instrument designed to be used on a woman, but which is, to date, unused.''"
        ],
        0.2702702702702703,
        [
            3987,
            4025
        ]
    ],
    [
        [
            "So Barack Obama and Donald Trump somehow ended up at the same barber shop... As they sat there, each being worked on by a different barber, not a word was spoken. The barbers were both afraid to start a conversation, for fear that it would turn nasty. As the barbers finished their shaves in silence, the one who had Trump in his chair reached for the aftershave. But Donald was quick to stop him, jokingly saying, \"No thanks. My wife, Melania, will smell that and think I''ve been in a brothel.\" The second barber turned to Barack and said, \"How about you, Mr. Obama ?\" Barack replied, \"Go right ahead, my wife Michelle doesn''t know what the inside of a brothel smells like.\"",
            "Trump and Obama getting haircut is same barbershop Donald Trump and Barack Obama end up in the same barbershop As they sat there, each being worked on by a different barber, not a word was spoken. The barbers were even afraid to start a conversation, for fear that it would turn into politics. As the barbers finished their shaves, the one who had Trump in his chair reached for the aftershave. Trump was quick to stop him saying \"No way buddy, my wife will smell that and think I''ve been in a damn whorehouse.\" The second barber turned to Obama and said \"How about you?\" Obama replied, \"Go ahead, my wife doesn''t know what the inside of a whorehouse smells like."
        ],
        0.2782608695652174,
        [
            4002,
            4598
        ]
    ],
    [
        [
            "Several centuries ago, the Pope decreed that all the Jews had to convert to Catholicism or leave Italy. There was a huge outcry from the Jewish community, so the Pope offered a deal. He''d have a religious debate with the leader of the Jewish community... If the Jews won, they could stay in Italy; if the Pope won, they''d have to convert or leave.\n The Jewish people met and picked an aged and wise Rabbi to represent them in the debate.\n However, as the Rabbi spoke no Italian, and the Pope spoke no Hebrew, they agreed that it would be a ''silent'' debate.\n On the chosen day, the Pope and the Rabbi sat opposite each other.\n The Pope raised his hand and showed three fingers.\n The Rabbi looked back and raised one finger.\n Next, the Pope waved his finger around his head.\n  The Rabbi pointed to the ground where he sat.\n The Pope brought out a communion wafer and a chalice of wine.\n The Rabbi pulled out an apple.\n With that, the Pope stood up and declared himself beaten and said that the Rabbi was too clever. \n The Jews could stay in Italy!\n Later the cardinals met with the Pope and asked him what had happened.\n  The Pope said, \"First I held up three fingers to represent the Trinity. He responded by holding up a single finger to remind me there is still only one God common to both our beliefs. Then, I waved my finger around my head to show him that God was all around us. He responded by pointing to the ground to show that God was also right here with us. Finally, I pulled out the wine and wafer to show that God absolves us of all our sins. He pulled out an apple to remind me of the original sin. He bested me at every move and I could not continue!\"\n Meanwhile, the Jewish community gathered to ask the Rabbi how he had won. \n \"I don''t have a clue!!!\" the Rabbi said.\n \"First, he told me that we had three days to get out of Italy, so I gave him the finger. Then he tells me that the whole country would be cleared of Jews, so I told him that we were staying right here.\"\n \"And then what?\" asked a woman.\n  \"Who knows!!\" said the Rabbi. \"He took out his lunch, so I took out mine!\"",
            "Several centuries ago, the Pope decreed that all the Jews had to convert to Catholicism or leave Italy. There was a huge outcry from the Jewish community, so the Pope offered a deal. He''d have a religious debate with the leader of the Jewish community... If the Jews won, they could stay in Italy; if the Pope won, they''d have to convert or leave.\n The Jewish people met and picked an aged and wise Rabbi to represent them in the debate.\n However, as the Rabbi spoke no Italian, and the Pope spoke no Hebrew, they agreed that it would be a ''silent'' debate.\n On the chosen day, the Pope and the Rabbi sat opposite each other.\n The Pope raised his hand and showed three fingers.\n The Rabbi looked back and raised one finger.\n Next, the Pope waved his finger around his head.\n The Rabbi pointed to the ground where he sat.\n The Pope brought out a communion wafer and a chalice of wine.\n The Rabbi pulled out an apple.\n With that, the Pope stood up and declared himself beaten and said that the Rabbi was too clever.\n The Jews could stay in Italy!\n Later the cardinals met with the Pope and asked him what had happened.\n The Pope said, \"First I held up three fingers to represent the Trinity. He responded by holding up a single finger to remind me there is still only one God common to both our beliefs. Then, I waved my finger around my head to show him that God was all around us. He responded by pointing to the ground to show that God was also right here with us. Finally, I pulled out the wine and wafer to show that God absolves us of all our sins. He pulled out an apple to remind me of the original sin. He bested me at every move and I could not continue!\"\n Meanwhile, the Jewish community gathered to ask the Rabbi how he had won.\n \"I don''t have a clue!!!\" the Rabbi said.\n \"First, he told me that we had three days to get out of Italy, so I gave him the finger. Then he tells me that the whole country would be cleared of Jews, so I told him that we were staying right here.\"\n \"And then what?\" asked a woman.\n \"Who knows!!\" said the Rabbi. \"He took out his lunch, so I took out mine!\""
        ],
        0.0,
        [
            4041,
            4505
        ]
    ],
    [
        [
            "A blonde is overweight, so her doctor puts her on a diet. A blonde is overweight, so her doctor puts her on a diet.\n “I want you to eat regularly for two days, then skip a day, and repeat the procedure for two weeks. The next time I see you, you’ll have lost at least five pounds.”\n When the blonde returns, she’s lost nearly 20 pounds.\n “Wow, that’s amazing!” the doctor says.\n “Did you follow my instructions?”\n The blonde nods…\n “I’ll tell you, I''d thought I was going to drop dead that third day.\"\n “From hunger, you mean?” said the doctor.\n “No, from skipping,” replied the blonde.",
            "A blonde is terribly overweight, so her doctor puts her on a diet. \"I want you to eat regularly for 2 days, then skip a day, and repeat this procedure for 2 weeks. The next time I see you, you''ll have lost at least 5 pounds.\" When the blonde returned, she shocked the doctor by losing nearly 20 pounds. \"Why, that''s amazing!\" the doctor said, \"Did you follow my instructions?\" The blonde nodded, \"I''ll tell you though, I thought I was going to drop dead that 3rd day.\" \"From hunger, you mean?\", asked the doctor.\" \"No, from all that skipping.\""
        ],
        0.28421052631578947,
        [
            4107,
            4831
        ]
    ],
    [
        [
            "Man says to his boss, \"Can we talk? I have a problem.\" Boss: \"Problem? No such thing, we call it an opportunity!\"\n Man: \"Ok, I have a serious drinking opportunity.\"",
            "Man says to his boss “Can we talk? I have a problem.” Boss says “Problem? No such thing, we call it an opportunity!”\n Man says “Ok I have a serious drinking opportunity.”"
        ],
        0.15151515151515152,
        [
            4109,
            4186
        ]
    ],
    [
        [
            "Why did the slave go to college? To pick up his master''s degree.",
            "Why did the slave go to college? So he could pick up his Master''s degree."
        ],
        0.2857142857142857,
        [
            4121,
            4258
        ]
    ],
    [
        [
            "How do you milk sheep? With iPhone accessories.  ",
            "How do you milk sheep? With iPhone accessories."
        ],
        0.0,
        [
            4163,
            4262
        ]
    ],
    [
        [
            "At age 12, Little Johnny was blessed with a nine inch penis.  \n And three years later, that priest went to prison.",
            "At age 13, Little Johnny was blessed with an eight inch penis. And three years later, that priest went to prison."
        ],
        0.23076923076923078,
        [
            4227,
            4767
        ]
    ],
    [
        [
            "A girl came skipping home FROM school one day. \"Mommy, Mommy,\" she yelled, \"we were counting today, and all the other kids could only count to four, but I counted to 10. See? 1, 2, 3, 4, 5, 6,7, 8, 9, 10!\" \"Very good,\" said her mother. \"Is it because I''m blonde, Mommy?\" \"Yes, Honey, it''s because you''re blonde.\" The next day the girl came skipping home FROM school. \"Mommy, Mommy,\" She yelled, \"we were saying the alphabet today, and all the other kids could only say it to D, but I said it to G. See? A,b, c, d, e, f, g!\" \"Very good,\" said her mother. \"Is it because I''m blonde, Mommy?\" \"Yes, Honey, it''s because you''re blonde.\" The next day the girl came skipping home FROM school. \"Mommy, Mommy,\" she yelled, \"we were in gym class today, and when we showered, all the other girls had flat chests, but I have these!\" And she lifted her tank top to reveal a pair of 36Cs. \"Very good,\" said her embarrassed mother. \"Is it because I''m blonde, mommy?\" \"No, Honey, it''s because you''re 25.\"",
            "A girl came skipping home from school one day. \"Mommy, Mommy,\" she yelled, \"we were counting today, and all the other kids could only count to four, but I counted to 10. See? 1, 2, 3, 4, 5,6, 7, 8, 9, 10!\" \"Very good,\" said her mother.  \"Is it because I''m blonde?\" the girl said.  \"Yes, it''s because you''re blonde,\" said the mommy. The next day the girl came skipping home from school. \"Mommy, Mommy,\" she yelled, \"we were saying the alphabet today, and all the other kids could only say it to D, but I said it to G. See? A, B, C, D, E, F, G!\" \"Very good,\" said her mother.  \"Is it because I''m blonde, Mommy?\"  \"Yes, it''s because you''re blonde.\" The next day the girl came skipping home from school. Mommy, Mommy,\"she yelled, \"we were in gym class today, and when we showered, all theother girls had flat chests, but I have these!\" And she lifted her tanktop to reveal a pair of 36Cs.  \"Very good,\" said her embarrassed mother. \"Is it because I''m blonde, mommy?\" \"No Honey, it''s because you''re 24.\""
        ],
        0.22608695652173913,
        [
            4779,
            4897
        ]
    ],
    [
        [
            "A blonde with two red ears went to her doctor. The doctor asked her what had happened to her ears and she answered, \"I was ironing a shirt and the phone rang - but instead of picking up the phone, I accidentally picked up the iron and stuck it to my ear.\"\"Oh Dear!\" the doctor exclaimed in disbelief. \"But, what happened to yourother ear?\"\"The jerk called back!\"",
            "A blonde with two red ears went to her doctor. The doctor asked herwhat had happened to her ears and she answered,  \"I was ironing a shirt and the phone rang - but instead of picking up the phone I accidentally picked up the iron and stuck it to my ear.\" \"Oh Dear!\" the doctor exclaimed in disbelief. \"But, what happened toyour other ear?\" \"The jerk called back!\""
        ],
        0.06779661016949153,
        [
            4795,
            4933
        ]
    ],
    [
        [
            "There is a blonde, a redhead and a brunette on the stairway to heaven. God says, \"There are 3,000 steps and I''ll tell you a joke on each 1,000th step you reach. If you laugh you go to hell.\" So they start walking and reach to the first 1,000th step. God tells a joke, the brunette laughs and goes to hell. Then on the 2,000th step God tells a joke, the redhead laughs and goes to hell. On the 3,000th step God tells a joke, the blonde doesn''t laugh and proceeds to the gate. Suddenly, she bursts out laughing. God asks, \"what are you laughing about?\", so she replies, \"I just got the first joke!\".",
            "There is a blonde, a redhead and a brunette on the stairway to heaven.\nGod says, \"There are 3,000 steps and i''ll tell you a joke on each 1,000th step you reach. If you laugh you go to hell.\" So they start walking and reach to the first 1,000th step. God tells a joke, the brunette laughs and goes to hell.\n\nThen on the 2,000th step God tells a joke, the redhead laughs and goes to hell.\n\nOn the 3,000th step God tells a joke, the blonde doesn''t laugh and proceeds to the gate. \n\nSuddenly, she bursts out laughing. God asks, \"what are you laughing about?\", so she replies, \"i just got the first joke!\"."
        ],
        0.029411764705882353,
        [
            4797,
            4875
        ]
    ],
    [
        [
            "A blonde is walking down the street with her blouse open, exposing one of her breasts. A nearby policeman approaches her and remarks, \"Ma''am, are you aware that I could cite you for indecent exposure?\" \"Why, officer?\" asks the blonde. \"Because your blouse is open and your breast is exposed.\" \"Oh my goodness,\" exclaims the blonde, \"I must have left my baby on the bus!\"",
            "A blonde is walking down the street with her blouse open, exposing one of her breasts. A nearby policeman approaches her and remarks, \"Ma''am, are you aware that I could cite you for indecent exposure?\" \"Why, officer?\" asks the blonde. \"Because your blouse is open and your breast is exposed.\" \"Oh my goodness,\" exclaims the blonde, \"I left my baby on the bus!\""
        ],
        0.03636363636363636,
        [
            4798,
            4898
        ]
    ],
    [
        [
            "Three blondes were all applying for the last available position on the Highway Patrol. The detective conducting the interview looked at the 3 of them and said, \"So ya''ll want to be a cop, eh?\"The blondes all nodded. The detective got up, opened a file drawer and pulled out a file folder. Sitting back down, he opened it up and withdrew a picture, and said, \"To be a detective, you have to be able to detect. You must be able to notice things such as distinguishing features and oddities such as scars, etc.\"So he stuck the photo in the face of the 1st blonde and withdrew it after about 2 seconds. \"Now, he said, \"did you notice any distinguishing features about the man?\"The blonde immediately said, \"Yes, I did. He has only one eye!\"The detective shook his head and said, \"Of course he has only one eye in this picture! It''s a profile of his face! You''re dismissed!\"The 1st blonde hung her head and walked out of the office. The detective then turned to the 2nd blonde, stuck the photo in her face for 2 seconds, pulled it back and said, \"What about you? Notice anything unusual or outstanding about this man?\"\"Yes! He only has one ear!\"The detective put his head in his hand and exclaimed, \"Didn''t you hear what I just told the other lady? This is a profile of the man''s face! Of course you can only see one ear!! You''re excused, too!\"The 2nd blonde sheepishly walked out of the office. The detective turned his attention to the 3rd and last blonde and said, \"This is probably a waste of time, but.......\" He flashed the photo in her face for a couple of seconds and withdrew it, saying \"All right. Did you notice anything distinguishing or unusual about this man?\"The blonde said, \"I did. This man wears contact lenses.\"The detective frowned, took another look at the picture and began looking at some of the papers in the folder. He looked up at the blonde with a puzzled expression and said, \"You''re absolutely right! His bio says he wears contacts... How in the world could you tell that by looking at this picture?\"The blonde rolled her eyes and said, \"Well duh! With only one eye and one ear, he certainly can''t wear glasses!\"",
            "Three blondes were all vying for the last available position on the local police force. The detective conducting the interview looked at the three of them and said, \"So you all want to be a cop, eh?\"The blondes all nodded. The detective got up, opened a file drawer and pulled out a file folder. Sitting back down, he opened it up and withdrew a photograph, and said, \"To be a detect, you have to be able to DETECT. You must be able to notice things such as distinguishing features and oddities such as scars, etc.\" So saying, he stuck the photo in the face of the first blonde and withdrew it after about 2 seconds. \"Now, he said, \"Did you notice any distinguishing features about this man?\"The blonde immediately said, \"Yes, I did. He only has one eye!\"The detective shook his head and said, \"Of COURSE he only has one eye in this picture! It''s a PROFILE of his face! You''re dismissed!\"The first blonde hung her head and walked out of the office. The detective then turned to the second blonde, stuck the photo in her face for two seconds, pulled it back and said, \"What about you? Notice anything unusual or outstanding about this man?\"The blonde immediately shot back, \"Yep! He only has one ear!\"The detective put his head in his hand and exclaimed, \"Didn''t you hear what I just said to the other lady? This is a PROFILE of the man''s face! Of COURSE you can only see one ear!! You''re excused, too! You''d never make a good detective!\"The second blonde sheepishly walked out of the office.The detective turn his attention to the last blonde and said, \"This is probably a waste of time, but....\". He flashed the photo in her face for a couple of seconds and withdrew it, saying, \"Alright. Did YOU notice anything distinguishing or unusual about this man?\"The blonde said, \"Yes, I did. This man wears contact lenses.\"The detective frowned, took another look at the picture and began looking at some of the papers in the folder. He looked up at the blonde with a puzzled expression and said, \"You''re absolutely right! His bio says he wears contacts! How in the world could tell that by looking at this picture?\"The blonde rolled her eyes and said, \"DUH! He has only one eye and one ear, he certainly CAN''T WEAR GLASSES!\""
        ],
        0.2300469483568075,
        [
            4811,
            4949
        ]
    ],
    [
        [
            "A young blonde was on vacation in the depths of Louisiana. She wanted a pair of genuine alligator shoes in the worst way, but was very reluctant to pay the high prices the local vendors were asking.After becoming very frustrated with the \"no haggle\" attitude of one of the shopkeepers, the blonde shouted, \"Maybe I''ll just go out and catch my own alligator so I can get a pair of shoes at a reasonable price!\"The shopkeeper said, \"By all means, be my guest. Maybe you''ll luck out and catch yourself a big one!\" Determined, the blonde turned and headed for the swamps, set on catching herself an alligator.Later in the day, the shopkeeper was driving home, when he spotted the young woman standing waist deep in the water, shotgun in hand. Just then, he saw a huge 9-foot alligator swimming quickly toward her. She took aim, killed the creature, and with a great deal of effort hauled it on to the swamp bank. Lying nearby were several more of the dead creatures. The shopkeeper watched in amazement. Just then the blonde flipped the alligator on its back, and frustrated, shouts out, \"Damn it, this one isn''t wearing any shoes either!\"",
            "A young blonde was on vacation in the depths of Louisiana. She wanted a pair of genuine alligator shoes in the worst way, but was very reluctant to pay the high prices the local vendors were asking. \nAfter becoming very frustrated with the \"no haggle\" attitude of one of the shopkeepers, the blonde shouted, \"Maybe I''ll just go out and catch my own alligator so I can get a pair of shoes at a reasonable price!\" \nThe shopkeeper said, \"By all means, be my guest. Maybe you''ll luck out and catch yourself a big one!\" \nDetermined, the blonde turned and headed for the swamps, set on catching herself an alligator. \nLater in the day, the shopkeeper was driving home, when he spotted the young woman standing waist deep in the water, shotgun in hand. Just then, he saw a huge 9-foot alligator swimming quickly toward her. She took aim, killed the creature, and with a great deal of effort hauled it on to the swamp bank. \nLying nearby were several more of the dead creatures. The shopkeeper watched in amazement. Just then the blonde flipped the alligator on its back, and frustrated, shouted out, \"Damn it, this one isn''t wearing any shoes either!\""
        ],
        0.050724637681159424,
        [
            4878,
            4944
        ]
    ],
    [
        [
            "One cold Winter day, a blonde decides she wants to take up ice fishing. When she gets to the pond, she begins to cut a hole in the ice. As she does, she hears a voice. \"There''s no fish there...\".     Puzzled, the blonde picks up her stuff and cuts another hole a few feet away. Again, she hears the voice. \"There''s no fish there...\"    The blonde is confused, but still determined. About 10 feet away, she begins to cut another ice hole. \"There''s no fish there...\", she hears.     She immediately turns her head to the sky and says, \"Is that you, God?\"\"NO! IT''S THE MANAGER OF THE ICE-SKATING RINK! THERE''S NO FISH THERE!",
            "One cold Winter day, a blonde decides she wants to take up ice fishing. When she gets to the pond, she begins to cut a hole in the ice. As she does, she hears a voice. \"There''s no fish there...\". \n    Puzzled, the blonde picks up her stuff and cuts another hole a few feet away. Again, she hears the voice. \"There''s no fish there...\"\n    The blonde is confused, but still determined. About 10 feet away, she begins to cut another ice hole. \"There''s no fish there...\", she hears. \n    She immediately turns her head to the sky and says, \"Is that you, God?\"\n\n\"NO! IT''S THE MANAGER OF THE ICE-SKATING RINK! THERE''S NO FISH THERE!\""
        ],
        0.0,
        [
            4899,
            4908
        ]
    ],
    [
        [
            "A man was walking down the street when he noticed his grandfather sitting on the porch, in the rocking chair, with nothing on from the waist down. \"Grandpa, what are you doing?\" he exclaimed. The old man looked off in the distance without answering. \"Grandpa, what are you doing sitting out here with nothing on below the waist?\" he asked again. The old man slowly looked at him and said,\"Well, last week I sat out here with no shirt on, and I got a stiff neck. This is your grandma''s idea.\"",
            "A man was walking down the street when he noticed his grandpa sitting on the porch, in the rocking chair, with nothing on from the waist down. \"Grandpa, what are you doing?\" he exclaimed. The old man looked off in the distance and did not answer him. \"Grandpa, what are you doing sitting out here with nothing on below the waist?\" he asked again. The old man looked at him and said, \"Well, last week I sat out here with no shirt on, and I got a stiff neck. This was your Grandma''s idea!\""
        ],
        0.18666666666666668,
        [
            5207,
            5372
        ]
    ],
    [
        [
            "Everybody on earth dies and goes to heaven. God comes and says, \"I want the men to make two lines. One line for the men that dominated their women on earth and the other line for the men that were dominated by their women. Also, I want all the women to go with St. Peter.\"With that said and done, the next time God looked, the women are gone and there are two lines. The line of the men that were dominated by their women was 100 miles long, and in the line of men that dominated their women, there was only one man.God got mad and said, \"You men should be ashamed of yourselves. I created, you in my image and you were all whipped by your mates. Look at the only, one of my sons that stood up and made me proud. Learn from him! Tell them my son, how did you manage to be the only one in this line?\"And the man replied, \"I don''t know, my wife told me to stand here.\"",
            "Everybody on earth dies and goes to heaven. God comes and says, \"I want the men to make two lines. One line for the men that dominated their women on earth and the other line for the men that were dominated by their women. Also, I want all the women to go with St. Peter.\" With that said and done, the next time God looked, the women are gone and there are two lines. The line of the men that were dominated by their women was 100 miles long, and in the line of men that dominated their women, there was only one man. God got mad and said, \"You men should be ashamed of yourselves. I created, you in my image and you were all whipped by your mates. Look at the only,one of my sons that stood up and made me proud. Learn from him! Tell them my son, how did you manage to be the only one in this line?\" And the man replied, \"I don''t know, my wife told me to stand here.\""
        ],
        0.019417475728155338,
        [
            5259,
            5471
        ]
    ],
    [
        [
            "Everybody on earth dies and goes to heaven. God comes and says, \"I want the men to make two lines. One line for the men that dominated their women on earth and the other line for the men that were dominated by their women. Also, I want all the women to go with St. Peter.\"With that said and done, the next time God looked, the women are gone and there are two lines. The line of the men that were dominated by their women was 100 miles long, and in the line of men that dominated their women, there was only one man.God got mad and said, \"You men should be ashamed of yourselves. I created, you in my image and you were all whipped by your mates. Look at the only, one of my sons that stood up and made me proud. Learn from him! Tell them my son, how did you manage to be the only one in this line?\"And the man replied, \"I don''t know, my wife told me to stand here.\"",
            "When the end of the world comes, everybody on earth goes to heaven. God comes and says, \"I want the men to make two lines. One line for the men that dominated their women on earth and the other line for the men that were dominated by their women. Also, I want all the women to go with St. Peter.\" With that said and done, the next time God looked, the women are gone and there are two lines. The line of the men that were dominated by their women was 100 miles long, and in the line of men that dominated their women, there was only one man. God became angry and said, \"You men should be ashamed of yourselves. I created you in my image and you were all whipped by your mates. Look at the only one of my sons that stood up and made me proud. Learn from him! Tell them my son, how did you manage to be the only one in this line?\" And the man replied, \"I don''t know, my wife told me to stand here.\""
        ],
        0.11009174311926606,
        [
            5259,
            6386
        ]
    ],
    [
        [
            "A funeral service is being held for a woman who has just passed away. At the end of the service the pallbearers are carrying the casket out when they accidentally bump into a wall, jarring the casket. They hear a faint moan. They open the casket and find that the woman is actually alive! She lives for ten more years, and then finally dies. A ceremony is again held at the same place, and at the end of the ceremony the pallbearers are again carrying out the casket. As they are walking, the husband cries out, \"Watch the wall!\"",
            "A funeral service is being held in a synagogue for a woman who has just passed away. At the end of the service the pallbearers are carrying the casket out, when they accidentally bump into a wall, jarring the casket. They hear a faint moan. They open the casket and find that the woman is actually alive. She lives for ten more years and then dies. A ceremony is again held at the same synagogue and at the end of the ceremony the pallbearers are again carrying the casket. As they are walking out, the husband cries, \"Watch out for the wall!\""
        ],
        0.09090909090909091,
        [
            5361,
            5431
        ]
    ],
    [
        [
            "A man and a friend are playing golf one day at their local golf course. One of the guys is about to chip onto the green when he sees a long funeral procession on the road next to the course. He stops in mid-swing, takes off his golf cap, closes his eyes and bows in prayer. His friend says, \"Wow, that is the most thoughtful and touching thing I have ever seen. You truly are a kind man.\" The man then replies, \"Yeah, well we were married 35 years.\"",
            "A man and a friend are playing golf one day. One of the guys is about to chip onto the green when he sees a long funeral procession on the road next to the course.He stops in mid-swing, takes off his golf cap, closes his eyes, and bows down in prayer. His friend says: \"Wow that is the most thoughtful and touching thing I have ever seen. You are truly a kind man.\"The man then replies: \"Yeah, well, we were married 35 years.\""
        ],
        0.12658227848101267,
        [
            5388,
            5944
        ]
    ],
    [
        [
            "\"Mr. johns, I have reviewed this case very carefully,\" the divorce court judge said, \"and I''ve decided to give your wife $275 a week.\" \"That''s very fair, your honor,\" the husband said. \"And every now and then I''ll try to send her a few bucks myself.\"",
            "\"Mr. Quinn, I have reviewed this case very carefully,\" the divorce court judge said, \"and I''ve decided to give your wife $775 a week.\"\"That''s very fair, your honor,\" the husband said. \"And every now and then I''ll try to send her a few bucks myself.\""
        ],
        0.08333333333333333,
        [
            5424,
            5452
        ]
    ],
    [
        [
            "On the first day of college, the dean addressed the students, pointing out some of the rules: \"The female dormitory will be out-of-bounds for all male students, and the male dormitory to the female students. Anybody caught breaking this rule will be fined $20 the first time. Anybody caught breaking this rule the second time will be fined $60. Being caught a third time will cost you $180. Are there any questions?\" \"How much for a season pass?\"",
            "On the first day of college, the Dean addressed the students, pointing out some of the rules. \"The female dormitory will be out-of-bounds for all male students, and the male dormitory to the female students. Anybody caught breaking this rule will be fined $40 the first time.\"He continued, \"Anybody caught breaking this rule the second time will be fined $90. Being caught a third time will incur a hefty fine of $200. Are there any questions?\"At this, a male student in the crowd inquires, \"How much for a season pass?\""
        ],
        0.323943661971831,
        [
            5440,
            5477
        ]
    ],
    [
        [
            "Everybody on earth dies and goes to heaven. God comes and says, \"I want the men to make two lines. One line for the men that dominated their women on earth and the other line for the men that were dominated by their women. Also, I want all the women to go with St. Peter.\" With that said and done, the next time God looked, the women are gone and there are two lines. The line of the men that were dominated by their women was 100 miles long, and in the line of men that dominated their women, there was only one man. God got mad and said, \"You men should be ashamed of yourselves. I created, you in my image and you were all whipped by your mates. Look at the only,one of my sons that stood up and made me proud. Learn from him! Tell them my son, how did you manage to be the only one in this line?\" And the man replied, \"I don''t know, my wife told me to stand here.\"",
            "When the end of the world comes, everybody on earth goes to heaven. God comes and says, \"I want the men to make two lines. One line for the men that dominated their women on earth and the other line for the men that were dominated by their women. Also, I want all the women to go with St. Peter.\" With that said and done, the next time God looked, the women are gone and there are two lines. The line of the men that were dominated by their women was 100 miles long, and in the line of men that dominated their women, there was only one man. God became angry and said, \"You men should be ashamed of yourselves. I created you in my image and you were all whipped by your mates. Look at the only one of my sons that stood up and made me proud. Learn from him! Tell them my son, how did you manage to be the only one in this line?\" And the man replied, \"I don''t know, my wife told me to stand here.\""
        ],
        0.09259259259259259,
        [
            5471,
            6386
        ]
    ],
    [
        [
            "Four men went golfing one day. Three of them headed to the first teeandthe fourth went into the clubhouse to take care of the bill. The three men started talking and bragging about their sons. The first man told the others, \"My son is a home builder, and he is sosuccessful that he gave a friend a new home for free. Just gave it tohim!\" The second man said, \"My son was a car salesman, and now he owns amulti-line dealership. He''s so successful that he gave one of hisfriends a new Mercedes, fully loaded.\" The third man, not wanting to be outdone, bragged, \"My son is astockbroker, and he''s doing so well that he gave his friend an entireportfolio.\" The fourth man joined them on the tee after a few minutes of takingcare of business. The first man mentioned, \"We were just talking about oursons. How is yours doing?\" The fourth man replied, \"Well, my son is gay and go-go dances in a gaybar.\" The other three men grew silent as he continued, \"I''m not totallythrilled about the dancing job, but he must be doing well. His lastthree boyfriends gave him a house, a brand new Mercedes, and a stockportfolio.\"",
            "4 men went golfing one day. Three headed to the first tee while the other went to the clbhouse to take care of the bill. The three men started bragging about their sons. The first man told the others, \"My son is a home builder, and he is so successful that he gavea friend a new home for free.\" The second man said, \"My son was a car salesman, and now he owns a multi-line dealership. He''s so successful that he gave a friend a brand new mercedes, fully loaded.\" The third man not wanting to be outdone, bragged, \"My son is a stockbroker, and is so successful that he gave a friend an entire portfolio.\" The fourth man joined them on the tee after a few minutes of taking caring of business. The first man mentioned, \"We were just talking about our sons.How is yours doing?\" The fourth man replied, \"Well my son is gay and and dances in a gay bar.\" The others grew silent as he continued, \"I''m not tottally thrilled about the dancing job, but he must be doing good. His last three boyfriends gave him a house, a stock portfolio anda brand new mercedes.\""
        ],
        0.3108108108108108,
        [
            6351,
            6402
        ]
    ]
]